<template>
  <div class="page">
    <div class="title text-center">
      <b> 咨询师入驻及管理须知 </b>
    </div>

    <p class="text-left">
      咨询师使用<b>【随身云（南京）信息技术有限公司】</b>及其关联公司开发并运营的平台移动客户端“命理求真”（以实际上线名称为准，以下简称“本平台”）提供在线咨询、问答等服务时的相关服务和功能前签订本须知。本须知有未尽事宜的，适用平台《用户协议》的相关约定。咨询师签署本须知后即受本须知内容约束并承担法律责任。
    </p>
    <p class="text-left"><b>1. 总则</b></p>
    <p class="text-left">
      1.1
      本须知所称“平台”是指<b>【随身云（南京）信息技术有限公司】</b>及其关联公司拥有或实际运营的名为“命理求真”的产品，以下简称“平台”。
    </p>
    <p class="text-left">
      1.2
      咨询师根据平台认证要求及规则入驻成为“咨询师”，方可使用平台提供的相关服务开展包括但不限于答复咨询及问题等活动。
    </p>
    <p class="text-left">
      1.3 咨询师应充分了解平台之各项规则及要求
      （包括平台已发布及可能未来不时发布的对用户的各项管理规则及要求等，包括但不限于本须知以及用户协议、隐私权政策等，以下合称“平台规则”）。
    </p>
    <p class="text-left">
      1.4
      咨询师承诺并声明，咨询师在平台开展的活动均符合相关法律规定，且不得以履行本协议为名义，从事违反中华人民共和国及平台服务提供地的相关法律规定的行为。
    </p>
    <p class="text-left">
      1.5
      咨询师认可，双方属平等的商事合作关系，不构成任何法律层面的雇佣、劳动、劳务关系咨询师平台咨询师。
    </p>
    <p class="text-left">
      1.6咨询师与平台的合作期限自入驻之日起生效，直至平台后台取消其咨询师资格之日起失效。如后续再行恢复的，依旧适用本须知。
    </p>
    <p class="text-left"><b>2. 咨询师的权利和义务</b></p>
    <p class="text-left">2.1 咨询师行为约束</p>
    <p class="text-left">
      2.2.1 咨询师的行为
      （包括但不限于咨询师的言论、为其他本平台用户提供的咨询服务等）应符合法律法规、行业自律公约、平台规则、本须知之规定。当咨询师实施违法违规行为或违反管理规定的内容时，本平台有权视违规行为的严重程度，依据本须知的相关条款对咨询师进行处罚，详见本须知违约责任条款。
    </p>
    <p class="text-left">
      咨询师知悉并同意，在使用本平台服务时，由于内容和信息来源广泛且数量巨大，本平台无法对该内容和信息的准确性、真实性、可用性、安全性、完整性和正当性负责。咨询师可能会接触到不正确的、令人不快的、不适当的或令人厌恶的内容和信息，咨询师不会以此追究本平台的责任，但咨询师可以联系本平台进行投诉或举报；同时，本平台有权依法停止传播任何前述内容并采取相应处理，包括但不限于暂停咨询师继续使用本平台的部分或全部服务，保存有关记录并向主管部门报告。
    </p>
    <p class="text-left">
      2.2.2 咨询师认可并同意，咨询师应为咨询师违反须知的行为及后果独立承担责任，除法律有明确规定外，平台不对此承担法律责任。如咨询师实施了或平台有理由相信咨询师实施了上述行为
      （包括但不限于平台抽查发现、平台收到相关投诉、监管部门反馈/通知等），平台有权根据实际情况依据本须知对咨询师进行处罚和索赔，同时，应平台要求，咨询师还应积极配合平台发表书面声明以澄清事实，以避免损失进一步扩大。
    </p>
    <p class="text-left">
      2.2.3
      为积极响应主管部门的号召与要求，弘扬社会主义核心价值观，平台鼓励及倡导咨询师产出导向正确内容，依法依规引导用户合理消费，并为自身树立积极、正面、阳光健康的公众形象。咨询师不得鼓吹非理性消费或以任何不良、不当方式欺骗、诱导、胁迫或刺激用户充值或消费，不得以分享/推广假冒盗版商品、虚假宣传、引导私下交易等方式侵害用户合法权益，不得从事任何损害平台及其关联公司及平台产品和品牌形象的行为。特别地，咨询师同意并认可，无论在平台内外，亦无论在本须知签署之前或之后，咨询师均应遵守上述义务，否则，一经发现，平台将根据本须知约定对咨询师进行处罚，同时，平台有权保存相关信息并上报有关部门。若因咨询师违反上述条款而引发用户向平台投诉/索赔、导致平台遭受监管部门调查或被施以行政处罚，或给平台、平台及其关联公司造成负面舆论影响的，咨询师还应积极配合平台发表书面声明以澄清事实或消除影响，并承担平台为解决、处理上述处罚、投诉及消除负面影响等而支出的全部成本。
    </p>
    <p class="text-left">
      2.3
      若咨询师通过平台依约开展咨询答复等活动，则咨询师有权基于其他用户付费获得相关收益
      （具体可获得收益的场景以平台内届时提供的功能为准）。咨询师认可并同意，平台有权依据平台的运营规划、经营策略等制定、修订相应的费用结算政策，为避免疑义，咨询师理解并同意，咨询师开展活动相关的数据及应获得收益的具体金额以平台系统所统计的结果为准。
    </p>
    <p class="text-left">
      2.4
      若经平台核查认定咨询师全部或部分收益无效时，平台为履行法定义务、配合执法或履行社会责任等原因，有权自行决策将与上述无效收益对应的用户侧消费款项予以退还；咨询师应支持平台的相应决策，并配合平台要求退还咨询师的相关收益或等价金额。此时，平台有权从咨询师账号的虚拟权益、收益金额余额中径行扣除相应金额，若不足扣除时，咨询师应在平台作出通知后5个工作日内按照平台告知的方式补足。无效收益包括但不限于咨询师基于以下情形而获得的对应收益：无民事行为能力、限制民事行为能力人的用户消费而产生的咨询师的收益；因咨询师通过违法/违规行为而获取的收益；因司法，行政机关要求退还/划拨的收益
      （以及司法/行政机关要求退还/划拨用户消费金额时该等消费金额中对应的咨询师的收益）；用户使用非法收入、作假收入或非平台指定方式充值或消费而产生的咨询师的收益；用户依法撤销其消费行为时相应消费所对应的咨询师的收益。平台有权基于平台风控判断、用户投诉、行政或司法机关的要求等情形确认咨询师的部分或全部收益无效。
    </p>
    <p class="text-left">
      2.5
      为向咨询师提供相关服务所需，平台会收集并记录咨询师获取收益的相关记录，包括但不限于咨询师基于用户打赏所产生的收益、咨询师的收益余额、咨询师的消费信息及其他相关行为信息。
    </p>
    <p class="text-left"><b>3. 收益与费用</b></p>
    <p class="text-left">3.1 授权确认</p>
    <p class="text-left">
      咨询师确认加入文首提及的公会/公司，并由文首所属公司统一与平台进行费用结算，咨询师在平台产生的全部收益应当由其所属公司向咨询师支付，与平台无涉。咨询师确认签署本须知之日起已经知晓其所属公司与平台签署的《公会/公司服务合同》的全部内容。平台有权针对咨询师的违约行为要求其所属公司和咨询师承担连带责任。
    </p>
    <p class="text-left">
      3.2 收益扣除：当咨询师与用户之间存在有关本平台内交易的纠纷时，咨询师应当积极配合本平台的调查，在争议期间，本平台有权冻结咨询师存在争议部分等额的贡献值或收益，当本平台或任何主管行政机关、司法机关认定咨询师需要承担责任时，本平台有权直接划扣相关收益。上述纠纷包括但不限于因无民事行为能力人或限制民事行为能力人的民事行为被撤销或拒绝追认，因咨询师的服务存在瑕疵等产生的纠纷。当上述争议发生时，相关收益已经提取到咨询师个人支付账户的，本平台有权从尚未向咨询师支付的收益中冻结、扣除相应金额。
    </p>
    <p class="text-left">
      3.3 平台活动：本平台可能不时推出主题活动，及针对主题活动制定的特殊的收益规则或奖励政策，咨询师通过活动获得的收益或奖励的具体使用规则和期限以届时页面显示为准。
    </p>
    <p class="text-left"><b>4. 违约责任</b></p>
    <p class="text-left">
      4.1 若咨询师存在违约行为的，平台有权独立判断并视咨询师违约情节的严重程度采取下列某一项或者某几项措施追究咨询师的违约责任：
    </p>
    <p  >
      <ul>
        <li>
          警示；
        </li>
        <li>
           拒绝咨询师的咨询师认证申请、取消咨询师的咨询师认证资格、降低咨询师的账号等级、限制咨询师永久或在一定期限内申请咨询师认证的资格； 
        </li>
        <li>
       降低账号等级； 
        </li>
        <li>
       屏蔽、删除、断链违法违规及侵权内容； 
        </li>
        <li>
       拒绝咨询师通过平台发布内容、删除咨询师已发布的部分或全部内容； 
        </li>
        <li>
       限制/冻结咨询师账号的部分或全部权限/功能； 
        </li>
        <li>
       暂时冻结或者永久性地封禁/冻结咨询师的平台账号、使用设备； 
        </li>
        <li>
       重置咨询师账号的实名认证信息； 
        </li>
        <li>
       将咨询师的平台账号永久性地删除； 
        </li>
        <li>
          拒绝咨询师再次注册平台账号； 
        </li>
        <li>
      暂时中止咨询师收益的结算和支付； 
        </li>
        <li>
          扣除或清空咨询师账号内的全部或部分收益，作为咨询师违约而应支付给平台的违约金，如该等违约金不足弥补平台损失
      （包括但不限于平台向第三方支付的赔偿款、行政罚款、公证费、鉴定费、差旅费、律师费、诉讼费等合理费用）的，咨询师还应继续赔偿；
        </li>
        <li>
      单方面终止或解除双方合作，终止双方基于本须知的所有合作事宜，不再支付尚未支付的收益费用，同时咨询师应向平台退回所有已支付的款项。
        </li>
      </ul>
    </p>
    <p class="text-left">
      4.2 如因咨询师的任何不实陈述或保证，或因咨询师违反本须知项下的义务，或因咨询师对第三方的侵权行为或违约行为，导致平台面临任何索赔、承担任何责任（如行政处罚等）或遭受任何损失，咨询师应当采取适当的措施（包括但不限于与该第三方协调解决纠纷、采取公开声明消除影响等），保证平台免受上述事由的影响。 在该等情形下，平台就其因此所受损失保留向咨询师及咨询师所属公司索赔的权利（我方损失包括但不限于我方就履行本合同支出的成本、我方支付的赔偿金及和解金、诉讼费、仲裁费、律师费、取证费、鉴定费等一切费用），如咨询师的违约行为遭到媒体曝光，导致平台遭受不利影响及/或公关危机的，咨询师应积极配合平台发表书面声明，澄清事实并向用户和平台道歉。
    </p>
    <p class="text-left"><b>5. 关于通知</b></p>
    <p class="text-left">5.1 平台可能会以网页公告、网页/弹窗提示电子邮件、手机短信、常规信件传送、向咨询师注册的平台账户的管理系统内发送站内信等方式中的一种或多种，向咨询师送达关于本须知相关的各种通知、提示等信息，该等信息一经平台采取前述任何一种方式公布或发送，即视为送达并对咨询师产生约束力，请咨询师务必及时关注。若咨询师不接受的，请咨询师书面通知我方，否则视为咨询师已经接受、同意。</p>
    <p class="text-left">5.2 若由于咨询师提供的电子邮箱、手机号码、通讯地址等信息错误，导致咨询师未收到相关通知、提示等信息的，咨询师同意仍然视为咨询师已经收到相关信息并受其约束，一切后果及责任由咨询师自行承担。</p>
    <p class="text-left"><b>6. 其他</b></p>
    <p class="text-left">6.1 本须知一经签署即生效，解释及纠纷解决适用中华人民共和国大陆地区法律。</p>
    <p class="text-left">6.2 本须知签订地为中华人民共和国北京市丰台区。若咨询师和平台之间发生任何纠纷或争议，首先应友好协商解决：协商不成功的，双方均同意将纠纷或争议提交本须知签订地有管辖权的人民法院解决。</p>
    <p class="text-left">6.3 下附详细管理规范，咨询师需遵循规范。</p>
    <p>
      <b>附件：咨询师管理规范</b>
    </p>
    <p class="text-left">
      为创造一个和谐、智慧和有趣的社区氛围，咨询师需遵守咨询师管理规范内容，共同维护好我们的社区环境。
    </p>
    <p class="text-left">
      根据《中华人民共和国网络安全法》《互联网信息服务管理办法》等法律法规的相关规定，我们制定了《咨询师管理规范》（以下亦称：“本规范”）。
</p>
<p class="text-left">
  <b>一、总则</b>
</p>
<p class="text-left">
  本平台倡导咨询师发布符合下述当代社会主流价值观的内容。  
</p>
<p  class="text-left">
  1、遵守宪法和法律法规  
</p>
<p class="text-left">
2、践行社会主义核心价值观 
  
</p>
<p class="text-left">
3、弘扬爱国主义、集体主义和社会主义 
  
</p>
<p class="text-left">
4、传播正确的历史观、民族观、国家观和文化观 
  
</p>
<p class="text-left">
5、弘扬中华民族优秀传统文化 
  
</p>
<p class="text-left">
6、弘扬社会公德、职业道德、家庭和个人美德，尊重公序良俗 
  
</p>
<p class="text-left">
7、弘扬科学精神、普及科学知识 
  
</p>
<p class="text-left">
8、提倡积极健康向上的生活方式 
  
</p>
 
 
<p class="text-left">
  <b>
  二、违规行为
  </b>
</p>
<p class="text-left">
  （一）违反法律、行政法规、规章及公序良俗，或侵犯未成年人权益的行为：
</p>
<p class="text-left">
  1、平台严格遵守国家法律法规，命理求真平台内任何违反中华人民共和国现行有效的法律、行政法规、部门规章、地方政府规章的行为将被视为违规行为。
</p>
<p class="text-left">
  2、平台内任何制作、复制、发布、传播含有下列内容的信息的行为将被视为违规行为：  
<p class="text-left">
  （1）反对宪法所确定的基本原则的；
</p>
<p class="text-left">
  （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；  

</p>
<p class="text-left">
  （3）损害国家荣誉和利益的；  

</p>
<p class="text-left">
  （4）煽动民族仇恨、民族歧视，破坏民族团结的； 

</p>
<p class="text-left">
  （5）破坏国家宗教政策，宣扬邪教和封建迷信的； 

</p>
<p class="text-left">
  （6）散布谣言，扰乱社会秩序，破坏社会稳定的；  

</p>
<p class="text-left">
  （7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； 

</p>
<p class="text-left">
  （8）侮辱或者诽谤他人，侵害他人合法权益的；  

</p>
<p class="text-left">
  （9）含有法律、行政法规禁止的其他内容的。

</p>
</p>
<p class="text-left">
  3、平台内任何违背社会公序良俗，或者制作、复制、发布、传播含有违背社会公序良俗内容的信息的行为将被视为违规行为。
</p>
<p class="text-left">
  4、平台严格遵守相关法律法规，保护未成年人合法权益，平台内任何侵犯未成年人合法权益，或者制作、复制、发布、传播含有侵害未成年人合法权益内容的信息的行为将被视为违规行为。
  <p class="text-left">
    （1）涉及未成年人色情低俗的，如展示未成年人婚育、性侵害等 

  </p>
  <p class="text-left">
    （2）涉及未成年人暴力欺凌的，如施暴犯罪、残害体罚、校园欺凌等 

</p>
<p class="text-left">
  （3）涉及披露未成年人隐私的，如展示未成年人性器官，公开个人隐私等 

</p>
<p class="text-left">
  （4）涉及未成年人不良行为的，如宗教传授、饮酒吸烟、邪典动画等  

</p>
<p class="text-left">
  （5）涉及规避未成年人系统监管的，如故意规避防沉迷、青少年模式的方法攻略等 

</p>
<p class="text-left">
  （6）其他危害未成年人安全和健康的相关内容

</p>

 
</p>
<p class="text-left">
  （二）严重扰乱平台秩序、损害他人合法权益的行为
  <p class="text-left">
    1、账号违规行为 

</p>
<p class="text-left">
  （1）盗用、冒用、借用他人身份信息，或使用虚假材料、欺诈手段注册账号的； 

</p>
<p class="text-left">
  （2）盗用、冒用、借用他人账号，或将账号提供给他人使用的； 

</p>
<p class="text-left">
  （3）组织地域性、家族性或其他关联性账号群（账号数量超过5个，以下同），对账号进行出售、出租、分发、关联使用的； 

</p>
<p class="text-left">
  （4）账号名称、简介、头像等信息违反法律法规或侵犯他人合法权益的； 

</p>
<p class="text-left">
  （5）在账号使用过程中使用外挂、作弊工具、虚拟器、网络加速器、VPN等工具。

</p>
</p>
<p class="text-left">
  2、交易及导流行为 
  <p class="text-left">
    平台禁止侵害消费者合法权益或扰乱市场秩序的销售行为，禁止售卖高风险类内容，且不鼓励发布营销或导流的信息，包括但不限于以下内容：

  </p>
  <p class="text-left">
    （1）交易行为  
</p>
<p class="text-left">
  （2）侵害消费者合法权益的行为，如假冒伪劣商品、侵害他人账户财务、恶意骚扰等  

</p>
<p class="text-left">
  （3）扰乱市场秩序的行为，如虚假宣传、虚假交易、价格欺诈、侵犯知识产权等  

</p>
<p class="text-left">
  （4）发布售卖高风险类的相关内容，如医美整形、医疗器械等  

</p>
<p class="text-left">
  （5）发布其他具有营销倾向的内容，如代购、转卖、拼单等  

</p>
<p class="text-left">
  （6）导流行为 

</p>
<p class="text-left">
  （7）发布导流到个人的联系方式，如手机号、微信号、邮箱、地址等  

</p>
<p class="text-left">
  （8）发布导流到其他平台的联系方式，如网址链接、二维码、水印等 

</p>

</p>
<p class="text-left">
  3、服务违规行为 
  <p class="text-left">
    （1）损害他人合法权益 
    <p class="text-left">

      1）侮辱、诽谤他人，损害他人名誉的；  
</p>
<p class="text-left">
  2）冒充他人，未经许可使用他人肖像等损害他人姓名权、肖像权的；  

</p>
<p class="text-left">
  3）未经许可处理他人个人信息，披露他人隐私等损害他人隐私权或个人信息权益的；  

</p>
<p class="text-left">
  4）抄袭、模仿他人作品，未经许可使用他人商标、商号，未经许可实施他人专利等损害他人著作权、商标专用权、专利权等知识产权的； 

</p>
<p class="text-left">
  5）实施其他损害他人合法权益的行为的。 

</p>
<p class="text-left">
  （2）交易违规  
  <p class="text-left">
    1）引导线下交易的行为，包括但不限于：引导用户添加非命理求真平台账号、通过明示或暗示展示手机号码、第三方账号，违规收集用户个人信息等违规行为；  
</p>
<p class="text-left">
  2）诱导用户过度消费的行为，包括但不限于：通过明示或暗示鼓吹、刺激、诱导用户进行高额消费或超出其能力范围的消费，引导用户通过借贷、透支等不良方式进行过度消费等违规行为；  

</p>

<p class="text-left">
  3）诱导无民事行为能力人或限制民事行为能力人消费的；  

</p>
<p class="text-left">
  4）制作、复制、发布、传播商业广告或推广的；  

</p>
<p class="text-left">
  5）虚构、篡改账号的人气、点赞数量、粉丝数量、好评率等数据，或通过刷榜、控榜、控评等方式进行数据造假的；  

</p>
<p class="text-left">
  6）冒充用户交易，对其他咨询师进行恶意评价或实施其他不正当竞争行为的； 

</p>
<p class="text-left">
  7）诱导、胁迫用户进行评价或删除、修改评价的；  

</p>
<p class="text-left">
  8）其他服务交易违规行为。  

</p>
</p>
<p class="text-left">
  （3）利用宗教、封建迷信诱导用户 
  <p class="text-left">
    1）违法违规实施传教、布道行为，或灌输宗教信仰中的特殊概念、理念诱导、胁迫用户；  

</p>
<p class="text-left">
  2）违法违规组织会道门，宣扬邪教组织或宗教极端思想；  

</p>
<p class="text-left">
  3）超越艺术创作、情绪疏导、经验分享和人生激励的范畴，对用户咨询的问题、提出的疑惑进行绝对化的论断，或对事物发展的方向进行明显超越科学理性、生活经验常识和艺术创作范畴的预测； 

</p>
<p class="text-left">
  4）其他利用宗教、封建迷信、神学鬼学等诱导用户的行为。  

</p>
<p class="text-left">
  （4）服务存在显著瑕疵  
  <p class="text-left">
    1）回复、提供无效内容（图像、语音、文字等），包括但不限于：空语音、吐字不清、语速过快、声音太小、环境嘈杂等； 
</p>
<p class="text-left">
  2）套用模板回复，对不同用户的不同咨询套用相同或近似的内容进行回复的；  

</p>
<p class="text-left">
  3）发布投机取巧、照本宣科、循环、重复的内容，提供虚假回复，骗取用户好评等； 

</p>
<p class="text-left">
  4）抄袭、复制、传播他人创作的作品进行回复的；  

</p>
<p class="text-left">
  5）使用不文明、不礼貌、低俗、轻佻、偏激、含有人身攻击、贬低性词汇、污蔑他人等内容进行回复的；  

</p>
<p class="text-left">
  6）态度敷衍、暴戾、急躁、恶劣，数落或打压用户或他人，或者使用不适当的内容进行回复给用户造成心理焦虑或其他消极影响的；  

</p>
<p class="text-left">
  7）答非所问、不懂装懂或利用拖延、哄骗、诱导等方式延长服务时间的；  

</p>
<p class="text-left">
  8）虚假承诺、不履行承诺、夸大事实、虚假宣传的；  

</p>
<p class="text-left">
  9）服务结束后，对用户进行骚扰，或持续发布咨询相关内容进行影射、声讨、攻击、控诉的；  

</p>
<p class="text-left">
  10）其他服务存在明显瑕疵的。

</p>
</p>
</p>
  </p>
  
</p>
<p class="text-left">
<b>  三、违规责任</b>
</p>
<p class="text-left">
  1、当咨询师违反本规范的内容时，平台有权按照本规范的规定对咨询师进行处罚。平台按照本规范对咨询师处罚后，并不免除咨询师因违反法律法规及《咨询师入驻及管理须知》约定而应承担的法律责任。
</p>
<p class="text-left">
  2、违规处罚 
  <p class="text-left">
    （1）封禁账号 
    <p class="text-left">
      1）短期封禁：限制违规账号在24小时、3日、7日、30日、60日内的登录和使用。 

<p class="text-left">
  2）永久封禁：永久限制违规账号的登录和使用。 

</p>

</p>
<p class="text-left">
  （2）取消认证 
  <p class="text-left">
    中止或终止违规账号的认证资格、程序；取消违规账号的认证成绩、认证结果。 

</p>
</p>
<p class="text-left">
  （3）扣除收益 
</p>
<p class="text-left">
  扣除违规账号内5%至100%的待发放收益。 

</p>
<p class="text-left">
  （4）中止、终止合作关系 

</p>
<p class="text-left">
  平台有权根据相关法律法规及本规范的内容，独立判断咨询师是否存在违规行为以及咨询师违规行为的严重程度，并根据咨询师违规行为的类别、违规情节的轻重、违规的次数等情形综合决定咨询师应当承担的违规责任以及最终执行的处罚。咨询师有权按照本规范程序向我们提出异议或投诉、举报。<br>
最终以平台实际操作为准。
</p>
</p>



</p>
<p class="text-left">
  <b>
    平台有权根据相关法律法规及本规范的内容，在本规范规定的范围内，制定关于违规行为和违规处罚的细则或相关合规指引。违规处罚可以并处。当咨询师存在多种违规行为时，将被执行叠加处罚。
  </b>
</p>
<p class="text-left">
<b>  四、其他</b>
</p>
<div class="email text-left">
  咨询师对处罚决定有异议，可以通过发送邮件提出异议，邮箱地址：copilot7server <span class="address"></span> 。平台在收到咨询师的异议申请后将尽快核实并反馈咨询师。异议期间不停止处罚措施的执行。 

</div>
 
 

    
  </div>
</template>

<style>
 .email{
  font-size: .32rem;
  color:#fff
 }
 
 .address::after{
  content: '@wekoi.cn';
 }
 
.title {
  margin-top: 0.6rem;
  font-size: 0.4rem;
  font-weight: bold;
  color: #fff;
}

p {
  line-height: 1.5;
  font-size: 0.32rem;
  color: #fff;
  margin: .1rem auto;
}
a {
  text-decoration: none;
  color: #008bff;
}

b {
  color: #fff;
  font-weight: bold;
}
.text-center {
  text-align: center;
}
.text-left {
  text-indent: 0.64rem;
}
.text-flex {
  display: flex;
}
.ml-32 {
  margin-left: 0.32rem;
}
</style>
