<!--
 * @Author: ZhaoZhiqi
 * @Date: 2022-11-24 17:22:30
 * @LastEditors: ZhaoZhiqi
 * @LastEditTime: 2023-05-18 14:55:52
 * @Description: 隐私协议
 * @FilePath: \find-future-overseas\src\pages\service\service.vue
-->
<template>
    <div class="container">
        <h3>通用服務條款及隱私政策</h3>
        <h5>一、總則</h5>
        <p>1、為了保護網路資訊安全，保障公民、法人和其他組織的合法權益，維護國家安全和社會公共利益，根據國家法律法規以及全國人大常委會的相關規定，XKOI PTE. LTD（以下簡稱“公司”）制定並按照本協定提供網路服務。使用者應當充分閱讀並同意本協定的全部條款並按照頁面上的提示完成全部的註冊程式（未成年人應與法定監護人共同完成）。使用者選擇訪問或使用公司有關服務，將視為同意接受本協定全部條款的約束。 </p>
        <p>2、除非另有明確規定，公司所推出的新產品、新功能和新服務，均無條件的適用本協定。</p>
        <p>3、公司保留在任何時候修改本協議條款的權利，且無需另行通知。使用者在使用服務時應關注並遵守。</p>
        <p>4、使用者在使用公司提供的各項服務之前，應仔細閱讀本協議。如果您不同意本協議或公司的修改，可以主動取消公司提供的服務；如果您繼續使用公司服務，則視為您已經接受本協定全部內容，包括公司對本協定所做的任何修改。</p>
        <p>5、使用者無論通過何種方式使用公司服務，均受本協定約束。</p>

        <h5>二、協議的性質與條款的接受</h5>
        <p>1、本協定是使用者（無論個人或單位）與XKOI PTE. LTD（下稱“公司”）之間就测算服務的使用和管理所約定的協定（下稱“本協議”）。接受本協定的全部條款，構成使用者使用公司所提供的服務之先決條件，公司將嚴格依照本協定中的條款提供服務。</p>
        <p>2、使用者訪問或使用公司提供的服務，則表示使用者接受本協定的全部條款；如使用者不願意接受本協定的全部條款，則應不使用或主動退訂公司提供的服務。公司有權隨時修改本協定中的服務條款，一旦條款發生變更或修改，公司將在相關頁面上公示；如果使用者繼續使用公司提供的服務，則視為使用者已接受本協定的修改內容；如果使用者不同意本協議的修改，可以退訂已經訂閱的服務並停止使用。</p>
        <p>3、公司向使用者提供的收費服務，對於使用者已經繳納的服務費用，使用者符合退款條件時可通過公司公佈的聯繫方式進行退款。</p>

        <h5>三、使用者使用規則</h5>
        <p>1、使用者在使用公司服務的過程中，同意遵守中華人民共和國和服務提供地的相關法律、法規。在任何情況下，公司一旦有合理理由認為用戶的行為可能違反上述法律、法規，可以在任何時候不經事先通知終止向該使用者提供服務。</p>
        <p>2、使用者在申請使用公司服務時，必須向公司提供完整、真實、準確的個人資料。如果上述個人資料資訊發生變化，使用者應及時更改。</p>
        <p>3、用戶應妥善保管好自己的帳號、密碼，不得轉讓或出借給他人使用。使用者在使用公司服務後，須將有關帳號安全退出。當帳號或密碼遭到未經授權的使用，應當及時通知公司，公司依法根據使用者的通知、使用者的個人資料及現有技術手段協助使用者取回帳號、密碼，帳號或密碼遭到未經授權的使用期間造成的損失，公司不承擔任何責任。</p>
        <p>4、禁止用戶從事以下行為：</p>
        <p>（4.1）傳送包含任何反對中華人民共和國憲法所確定的基本原則、危害國家安全、洩露國家秘密、顛覆國家政權、破壞國家統一、破壞民族團結、損害國家榮譽和利益、煽動民族仇恨、民族歧視、破壞民族團結、破壞國家宗教政策、宣揚邪教和封建迷信、淫穢、色情、賭博、暴力、兇殺、恐怖或者教唆犯罪、侮辱或者誹謗他人，侵害他人合法權益的等法律、行政法規禁止的內容，包括但不限於資訊、資料、文字、軟體、音樂、照片、圖形、資訊或其他資料；</p>
        <p>（4.2）將侵犯任何人的姓名權、肖像權、智慧財產權（包括但不限於專利權、商標權、著作權、商業秘密等）或其他專屬權利的內容、或無權傳送的內容（包括但不限於內部資料、機密資料）加以上載、張貼、發送電子郵件或以其他方式傳送；</p>
        <p>（4.3）以任何方式危害未成年人；</p>
        <p>（4.4）偽造標題或以其他方式操控識別資料，使人誤認為該內容為公司所傳送；</p>
        <p>（4.5）冒充任何人或機構，或以虛偽不實的方式謊稱或使人誤認為與任何人或任何機構有關從事詐騙、欺騙行為；</p>
        <p>（4.6）傳播病毒軟體或其他破壞電腦代碼、檔案和程式之資料；</p>
        <p>（4.7）干擾或破壞公司服務或與公司網路服務相連的伺服器和網路；</p>
        <p>（4.8）將廣告函件、促銷資料、“垃圾郵件”等，加以上載、張貼、發送電子郵件或以其他方式傳送，但供前述目的使用的專用區域除外；</p>
        <p>（4.9）跟蹤或以其他方式騷擾他人；</p>
        <p>（4.10）其他違反任何相關的中國法律、法規、規章、條例等具有法律效力的規範的行為。</p>

        <h5>四、付費相關</h5>
        <p>1、使用者使用公司提供的服務時，在服務頁面輸入服務所必需的全部資訊後，根據頁面指示即可完成付款。</p>
        <p>2、如果用戶使用他人代付或以其他違規方式支付造成其他使用者或協力廠商權益受損時，不得因此要求公司作任何補償或賠償，公司保留隨時暫停或終止其使用各項服務及禁用其帳戶的權利。如公司有理由相信使用者的使用情況涉及違規支付、作弊或異常狀況，公司有權拒絕該使用者繼續支付並使用服務，並按本協定採取凍結、禁用帳戶等相關措施。</p>
        <p>3、如果使用者使用 iOS 設備充值錢包，應 Apple 公司要求用戶必須通過 Apple 應用內購買機制（In-App Purchase）進行支付。為保障帳號安全，請在個人 iOS 設備上使用個人常用 Apple ID 進行操作。如你選擇使用 iOS 設備進行支付，代表你同意並理解 Apple 公司及其應用內購買的相關條款和條件。（https://www.apple.com/legal/internet-services/itunes/appstore/cn/terms.html#APPS）</p>

        <h5>五、智慧財產權保護</h5>
        <p>1、公司對產品服務及本產品所使用的軟體所包含的受智慧財產權法或其他法律保護的資料享有相應的權利，本產品的整體內容版權歸公司所有。本產品所有設計圖樣以及其他圖樣、產品及服務名稱，均為公司所享有，任何人不得使用、複製或用作其他用途。使用者對本產品所使用的軟體有非專屬性使用權，但不得自行或許可任何協力廠商複製、修改、出售或衍生產品。</p>
        <p>2、經由本產品傳送的文字、圖片、音訊、視頻及其他內容，受到著作權法、商標法、專利法或其他法律的保護；除該文字、圖片、音訊、視頻及其他內容的上載使用者所享有的著作權，未經公司書面授權許可，協力廠商不得進行修改、出租、售賣或衍生其他作品。</p>
        <p>3、公司對其專有內容、原創內容和其他通過授權取得的獨佔或者獨家內容享有智慧財產權。未經公司書面許可，任何單位和個人不得私自轉載、傳播和提供收聽服務或者有其他侵犯公司智慧財產權的行為。否則，將承擔法律責任。</p>

        <h5>六、免責聲明</h5>
        <p>1、公司對於任何包含、經由或連結、下載或從任何與有關公司平臺所獲得的任何內容、資訊或廣告，不聲明或保證其正確性或可靠性；並且對於用戶經公司平臺上的廣告、展示而購買、取得的任何產品、資訊或資料，公司不負保證責任。使用者自行負擔使用上述內容、資訊或廣告的風險。</p>
        <p>2、公司不保證（包括但不限於）：</p>
        <p>（2.1）本服務適合使用者的使用要求；</p>
        <p>（2.2）本服務不受干擾，及時、安全、可靠或不出現錯誤，本服務可能出現瑕疵，包括但不限於駭客入侵、網路中斷、電信問題及其他不可抗力等；</p>
        <p>（2.3）使用者經由本服務取得的任何產品、服務或其他材料符合使用者的期望；</p>
        <p>3、用戶使用經由公司平臺下載的或取得的任何資料，其風險自行負擔，因該使用而導致使用者電腦系統損壞或資料流程失，公司不承擔任何責任；</p>
        <p>4、基於以下原因而造成的利潤、商業信譽、資料損失或其他有形或無形損失，公司不承擔任何責任，也不承擔賠償義務：</p>
        <p>（4.1）本服務的使用或無法使用；</p>
        <p>（4.2）經由本服務購買或取得的任何產品、資料或服務；</p>
        <p>（4.3）使用者資料遭到未授權的使用或修改； </p>
        <p>（4.4）其他與本服務相關的事宜。</p>
        <p>5、公司在服務過程中可能會提供與其他國際互聯網網站或任何協力廠商資源的連結。除非另有聲明，公司無法對協力廠商網站、資源所提供之服務進行控制，使用者因使用上述網站或資源所產生的損失或損害，公司不承擔任何責任。</p>

        <h5>七、隱私政策</h5>
        <p>非常感謝您使用本公司網頁或APP，我司為了讓您能夠安心的使用本公司產品，為您所提供的各項服務及遵循法規保護您個人隱私及個人資料安全之相關規範要求。本公司制訂了隱私權政策，載明我們如何收集、使用、揭露、移轉及儲存您的個人資訊，以便提供你更貼心的服務。</p>
        <p class="bold">我們可能收集的資料</p>
        <p>當您使用我們的服務時，我們可能會收集、儲存和使用下列與您有關的資訊。如果您不提供相關資訊，可能無法註冊成為我們的用戶、無法享受我們提供的某些服務或無法得到最完整的服務。</p>
        <p class="bold">您提供的資料：</p>
        <p>• 您在註冊帳號或使用我們的服務時，向我們提供的相關個人資料，例如您的網路照片、姓名、生辰八字、電子郵件等；</p>
        <p>• 您通過我們的服務向其它方提供的共用資料，以及您使用我們服務時所儲存的資料。</p>
        <p>• 您付費或者辦理退款需要向我們提供的資料，包括您的帳號資訊、付款資訊等資料。</p>
        <p>• 任何其他取得您同意的目的。</p>
        <p class="bold">• 任何其他取得您同意的目的。</p>
        <p>• 在其它方使用我們的服務時所提供有關您的共用資料。</p>
        <p>我們獲取的您的個人資料：</p>
        <p>當您使用服務時，我們可能收集如下資料：</p>
        <p>日誌資訊，指您使用我們的服務時，系統可能通過cookies、web beacon 或其他方式自動搜集技術資訊，包括：</p>
        <p>• 設備或軟體資料，例如您的移動設備、網頁流覽器或用於接入我們服務的其他程式所提供的配置資料、您的IP位址和移動設備所用的版本和設備識別字；</p>
        <p>• 在使用我們服務時搜索或流覽的內容，例如您使用的網頁搜尋詞彙、訪問的社交媒體頁面url位址，以及您在使用我們服務時流覽或要求提供的其他資料和內容詳情；</p>
        <p>我們可能如何使用資料：</p>
        <p>我們可能將在向您提供服務的過程之中所收集的資訊用作下列用途：</p>
        <p>• 向您提供服務；</p>
        <p>• 在我們提供服務時，用於身份驗證、客戶服務、安全防範、詐騙監測、存檔和備份用途，確保我們向您提供的產品和服務的安全性；</p>
        <p>• 使我們更加瞭解您如何接入和使用我們的服務，從而針對性地響應您的個性化需求，例如語言設定、位置設定、個性化的説明服務和指示，或對您和其他用戶作出其他方面的回應；</p>
        <p>• 説明我們設計新服務，改善我們現有服務；</p>
        <p>• 向您提供與您更加相關的廣告以替代普遍投放的廣告；</p>
        <p>• 評估我們服務中的廣告和其他促銷及推廣活動的效果，並加以改善；</p>
        <p>• 軟體認證或管理軟體升級；</p>
        <p>• 讓您參與有關我們產品和服務的調查。</p>
        <p>為了讓您有更好的體驗、改善我們的服務或您同意的其他用途，在符合相關法律法規的前提下，我們可能將通過某一項服務所收集的資料，以彙集資訊或者個性化的方式，用於我們的其他服務。例如，在您使用我們的一項服務時所收集的資訊，可能在另一服務中用於向您提供特定內容，或向您展示與您相關的、非普遍推送的訊息。如果我們在相關服務中提供了相應選項，您也可以授權我們將該服務所提供和儲存的資訊用於我們的其他服務。</p>
        <p class="bold">您如何訪問和控制自己的個人資料：</p>
        <p>我們將盡一切可能採取適當的技術手段，保證您可以訪問、更新和更正自己的註冊資料或使用我們的服務時提供的其他個人資料。在訪問、更新、更正和刪除前述資料時，我們可能會要求您進行身份驗證，以保障帳號安全。</p>
        <p class="bold">我們可能分享的資料：</p>
        <p>除以下情形外，未經您同意，我們以及我們的關聯公司不會與任何協力廠商分享您的個人信息：</p>
        <p>• 向您提供我們的服務；</p>
        <p>• 實現“我們可能如何使用資料”部分所述目的；</p>
        <p>• 履行我們在本《隱私政策》中的義務和行使我們的權利；</p>
        <p>• 理解、維護和改善我們的服務；</p>
        <p>如我們或我們的關聯公司與任何上述協力廠商分享您的個人資料，我們將努力確保該等協力廠商在使用您的個人資料時遵守本《隱私政策》及我們要求其遵守的其他適當的保密和安全措施。</p>
        <p>• 我們或我們的關聯公司還可能為以下需要而保留、保存或披露您的個人資料：</p>
        <p>• 遵守適用的法律法規；</p>
        <p>• 遵守法院命令或其他法律程式的規定；</p>
        <p>• 遵守相關政府機關的要求；</p>
        <p>• 為遵守適用的法律法規、維護社會公共利益，或保護我們的客戶、我們或我們的集團公司、其他用戶或雇員的人身和財產安全或合法權益所合理必需的用途。</p>
        <p>資訊安全：</p>
        <p>• 我們僅在本《隱私政策》所述目的所必需的期間和法律法規要求的時限內保留您的個人資料；</p>
        <p>• 我們使用各種安全技術和程式，以防資料的丟失、不當使用、未經授權閱覽或披露。例如，在某些服務中，我們將利用加密技術（例如SSL）來保護您提供的個人資料。但有一點需要向您表明：儘管我們將傾盡所能地保護您的資訊安全，但仍然會存在由於技術限制或惡意入侵等可控範圍外的安全問題。</p>
        <p class="bold">您分享的資料：</p>
        <p>• 隨著我們的業務發展，您可能不僅與自己的社交網路，也與使用該服務的所有使用者公開分享您的相關資料。例如，您在我們的服務中所上傳或發佈的資訊（包括您公開的個人資訊、您建立的名單）、您對其他人上傳或發佈的資料作出的回應，以及包括與這些資料有關的位置資料和紀錄資訊。使用我們服務的其他使用者也有可能分享與您有關的資訊（包括位置資料和紀錄資訊）。 因此，請您謹慎考慮通過我們的服務上傳、發佈和交流的資訊內容。在一些情況下，您可通過我們某些服務的隱私設定來控制有權流覽您共用資訊的使用者範圍。如要求從我們的服務中刪除您的相關資訊，請通過該等特別服務條款提供的方式操作。</p>
        <p>• 您分享的敏感個人資訊：某些個人資訊因其特殊性可能被認為是敏感個人資訊，例如您的種族、宗教、個人健康和醫療資訊等。相比其他個人資訊，敏感個人資訊將會受到更加嚴格的保護。但亦請注意，您在使用我們的服務時所提供、上傳或發佈的內容和資訊（例如有關您社交活動的照片等資訊），可能會洩露您的敏感個人資訊。因此您需要謹慎地考慮，是否在使用我們的服務時披露相關敏感個人資訊。</p>
        <p>您同意按本《隱私政策》所述的目的和方式來處理您的敏感個人資訊。</p>
        <p class="bold">我們可能如何收集資訊：</p>
        <p>我們或我們的協力廠商合作夥伴，可能通過cookies和web beacon收集和使用您的資訊，並將該等資訊儲存為記錄資訊。</p>
        <p class="bold">我們使用自己的cookies和web beacon，目的是為您提供更個性化的使用者體驗和服務，並用於以下用途：</p>
        <p>• 記住您的身份。例如：cookies和web beacon有助於我們辨認您作為我們的註冊用戶的身份，或保存您向我們提供的有關您的喜好或其他資訊；</p>
        <p>• 分析您使用我們服務的情況。例如，我們可利用cookies和web beacon來瞭解您使用我們的服務進行什麼活動，或哪些網頁或服務最受您的歡迎；</p>
        <p>• 廣告優化。 Cookies和web beacon有助於我們根據您的資訊，向您提供與您相關的廣告而非進行普遍的廣告投放。</p>
        <p>我們為上述目的使用cookies和web beacon的同時，可能將通過cookies和web beacon收集的非個人身份資料，經統計加工後提供給廣告商或其他合作夥伴，用於分析使用者如何使用我們的服務，並用於廣告服務。</p>
        <p>我們的產品和服務上可能會有廣告商或其他合作方放置的cookies和web beacon。這些cookies和web beacon可能會收集與您相關的非個人身份資訊，以用於分析使用者如何使用該等服務、向您發送您可能感興趣的廣告，或用於評估廣告服務的效果。這些協力廠商cookies和web beacon收集和使用該等資訊，不受本《隱私政策》約束，而是受相關使用者的隱私政策約束，我們不對協力廠商的cookies或web beacon承擔責任。</p>
        <p>您可以通過流覽器設置拒絕或管理cookies或web beacon。但請注意，如果停用cookies或web beacon，您有可能無法享受最佳的服務體驗，某些服務也可能無法正常使用。同時，您還會收到同樣數量的廣告，但這些廣告與您的相關性會降低。</p>
        <p class="bold">廣告服務：</p>
        <p>我們可能使用您的相關資訊，向您提供與您更加相關的廣告。</p>
        <p>我們也可能使用您的資訊，通過我們的服務、電子郵件或其他方式向您發送行銷內容，提供或推廣我們或協力廠商的如下商品和服務：</p>
        <p>• 我們的商品或服務，我們的關聯公司和合作夥伴的商品或服務，包括付款服務、網際網路搜索服務、位置和地圖服務、應用軟體和服務、資料管理軟體和網上廣告服務、資訊和通訊軟體或服務等（統稱“網際網路服務”）；</p>
        <p>• 協力廠商網際網路服務供應商，以及與下列有關的協力廠商商品或服務：食品和餐飲、體育、音樂、電影、電視、現場表演及其他藝術和娛樂、書冊、雜誌和其他刊物、服裝和配飾、珠寶、化妝品、個人健康和衛生、電子、收藏品、家用器皿、電器、家居裝飾和擺設、寵物、汽車、酒店、交通和旅遊、銀行、保險及其他金融服務、會員積分和獎勵計畫，以及我們認為可能與您相關的其他商品或服務。</p>
        <p>如您不希望我們將您的個人資料用作前述廣告用途，您可以通過我們在廣告中提供的相關提示，或在特定服務中提供的指引，要求我們停止為上述用途使用您的個人資料。</p>
        <p>我們可能向您發送的郵件和資訊：</p>
        <p>• 郵件和資訊推送：您在使用我們的服務時，我們可能使用您的資訊向您的設備發送電子郵件、新聞或推送通知。如您不希望收到這些資訊，可以按照我們的相關提示，在設備上選擇取消；</p>
        <p>• 與服務有關的公告：我們可能在必要時（例如因系統維護而暫停某一項服務時）向您發出與服務有關的公告。您可能無法取消這些與服務有關、性質不屬於推廣的公告。 隱私政策的適用例外：</p>
        <p>我們的服務可能包括或連接至協力廠商提供的社交媒體或其他服務（包括網站）。例如：</p>
        <p>• 您利用 “分享”鍵將某些內容分享到我們的服務，或您利用協力廠商聯機服務登錄我們的服務。這些功能可能會收集您的相關資訊（包括您的記錄資訊），並可能在您的電腦裝置cookies，從而正常運行上述功能；</p>
        <p>• 我們通過廣告或我們服務的其他方式向您提供連結，使您可以接入協力廠商的服務或網站；</p>
        <p>該等協力廠商社交媒體或其他服務可能由相關的協力廠商或我們運營。您使用該等協力廠商的社交媒體服務或其他服務（包括您向該等協力廠商提供的任何個人資訊），須受該協力廠商的服務條款及隱私政策（而非《通用服務條款及隱私政策》）約束，您需要仔細閱讀其條款。《通用服務條款及隱私政策》僅適用於我們所收集的資訊，並不適用於任何協力廠商提供的服務或協力廠商的資訊使用規則，我們對任何協力廠商使用由您提供的資訊不承擔任何責任。</p>

        <p class="bold">八、公司資訊</p>
        <p>公司名稱：XKOI PTE. LTD</p>
        <p>公司注册地址：10ANSONROAD#27-18 INTERNATIONAL PLAZA SINGAPORE (079903)</p>
        <p>聯繫方式：gongyueying@weli.cn</p>
    </div>
</template>

<script>
export default {
    data() {
        return {};
    },
    created() {
        document.title = "隱私權保護政策";
    },
    mounted() {},
};
</script>

<style lang="less" scoped>
.container {
    width: 100%;
    min-height: 100vh;
    box-sizing: border-box;
    font-size: 0.32rem;
    padding: 0.2rem 0.3rem;
    font-family: 微软雅黑;
    color: #314a46;
    background-color: #EAF3E9;
    h3 {
        font-size: 0.44rem;
        margin-top: 0.3rem;
        margin-bottom: 0.3rem;
        text-align: center;
    }

    h5 {
        font-size: 0.32rem;
        line-height: 0.64rem;
        margin-top: 0.2rem;
        margin-bottom: 0.2rem;
        text-align: left;
    }

    h6 {
        font-size: 0.32rem;
        line-height: 0.6rem;
        margin-top: 0.2rem;
        margin-bottom: 0.2rem;
        text-align: left;
        text-indent: 1.5em;
    }

    p {
        margin-top: 0;
        margin-bottom: 0.1rem;
        font-size: 0.32rem;
        line-height: 0.6rem;
        text-align: left;
        text-indent: 1.5em;
        word-wrap: break-word;
    }

    .underline {
        // text-decoration: underline;
    }

    .bold {
        font-weight: bold;
    }

    .mb_0 {
        margin-bottom: 0;
    }

    .no_indent {
        text-indent: 0em;
    }
}
</style>
