<!--
 * @Author: wujiang@weli.cn
 * @Date: 2024-01-10 15:48:49
 * @LastEditors: wujiang 
 * @LastEditTime: 2024-01-11 18:39:26
 * @Description: 
-->
<template>
  <div class="main">
    <div class="title text-center">
      <b> 隐私权政策 </b>
    </div>
    <p class="text-left">
      欢迎您使用“iKarma”（以下简称“本应用”）软件及相关服务。如您未明示同意本隐私权政策，我们无法为您提供完整的产品和服务。如果您同意了本隐私权政策后使用应用，我们将视为您接受和认可我们按照本政策对您的相关信息进行处理，并基于提供的具体产品和服务收集使用相应的个人信息。
    </p>
    <p class="text-left">
      本应用深知个人信息对您的重要性，并会尽遵守合法、正当、必要、诚信的原则处理您的个人信息。本应用将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
    </p>
    <p class="text-left">
      <b>
        请您在使用本应用及相关服务前仔细阅读并理解本政策，在确认充分理解并同意后使用本应用及相关服务。本政策有关您个人信息权益的条款我们已采取加粗形式提示，请您特别关注并重点阅读。
      </b>
    </p>
    <p>一、本应用如何收集和使用您的个人信息</p>
    <p class="text-left">
      个人信息是以电子或者其他方式记录的与已识别或者可识别的自然人有关的各种信息，不包括匿名化处理后的信息。
      <span style="color: red">
        本服务仅提供游客模式，在此前提下，我们仅收集以下必要基础信息。请您理解，下述信息无法单独或与其他信息结合用于识别特定自然人的身份。
      </span>
      本应用仅会处于本政策所述的以下目的，收集和使用您的个人信息：
    </p>
    <p class="text-left">
      <b>
        1.当您使用本应用运行期间，我们会通过收集您的设备型号、软件系统版本、软件安装列表、Mac地址、BSSID、唯一设备标识符（IMEI、IMSI、ICCID、Android_ID、IDFA）、IP、设备序列号、SIM序列号、蓝牙地址来标识唯一用户，从而进行统计分析以便我们为您提供信息展示的最优方案。此外，基于数据统计需要，我们也会在您的设备处于后台/静默状态时收集您的上述设备信息，并且完成相应统计后采用去标识化、加密等措施来进行保护。
      </b>
    </p>
    <p class="text-left">
      2.设备信息：我们会申请电话/设备权限，收集设备识别码相关信息，<b
        >用于信息推送和安全风控；拒绝该权限，将影响推送的准确度和账户安全状态的提示；</b
      >
    </p>
    <p class="text-left">
      <b>
        3.当您使用交互功能（如摇动、扭动、扭转设备）时，我们会调用设备的陀螺仪、加速度、重力传感器以识别判断您的设备状态。请您理解，单独的设备传感器数据不涉及任何个人位置信息且无法与其他信息结合用于识别特定自然人的身份。
      </b>
    </p>
    <p class="text-left">
      <b>
        4.根据相关法律法规规定，以下情形中收集、共享、转让、披露您的个人信息无需征得您的授权同意：<br />
        1）与国家安全、国防安全有关的；<br />
        2）与公共安全、公共卫生、重大公共利益有关的；<br />
        3）与犯罪侦查、起诉、审判和判决执行等有关的；<br />
        4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人授权同意的；<br />
        5）所收集的个人信息是您自行向社会公众公开的；<br />
        6）从合法公开披露的信息中收集您的个人信息的，如合法的新闻报道、政府信息公开等渠道；<br />
        7）法律法规规定的其他情形。
      </b>
    </p>
    <p>
      <b
        >二、通过内部数据分析和研究以及第三方SDK统计服务，改善本应用的产品或服务</b
      >
    </p>
    <p class="text-left">
      <b>
        本应用收集数据是根据您与本应用的互动和您所做出的选择，包括您的隐私设置以及使用的产品和功能。手机的数据包括SDK/API/JS代码版本、浏览器、互联网服务提供商、IP地址、平台、时间戳、应用标识符、应用程序版本、应用分发渠道、软件安装列表、设备标识符（IMEI、IMSI、ICCID、Android_ID、MEID）、Mac地址、IOS广告标识符(IDFA)、重力传感器。当本应用要将信息用于本隐私权政策所述目的之外时，会事先征求您的同意。
      </b>
    </p>
    <p>
      <b>三、本应用如何使用cookie和同类技术</b>
    </p>
    <p class="text-left">
      Cookie和同类技术是互联网中的通用常用技术。当您使用本应用及相关服务时，我们可能会使用相关技术向您的设备发送一个或多个Cookie或匿名标识符，以收集和存储您访问、使用本产品时的信息。我们使用Cookie和同类技术主要为了实现以下功能或服务：
    </p>
    <p class="text-left">
      <b>1.保障产品与服务的安全、高效运转</b>
    </p>
    <p class="text-left">
      我们可能会设置认证与保障安全性的cookie或匿名标识符，使我们确认你是否安全登录服务，或者是否遇到盗用、欺诈等不法行为。这些技术还会帮助我们改进服务效率，提升登录和响应速度。
    </p>
    <p style="color: red">
      我们承诺，我们不会将Cookie用于本隐私权政策所述目的之外的任何其他用途。
    </p>

    <p>
      <b>四、本应用如何使用sdk技术</b>
    </p>
    <p class="text-left">
      <b
        >SDK技术由与我们合作的第三方机构提供，我们通过使用SDK来帮助应用获得统计分析、信息推送等功能，我们通过其披露的技术文档知悉其要求获得授权的权限
        和所收集的数据，在收集过程中，数据会直接传输至第三方机构。</b
      >
    </p>
    <p>
      <b> 五、本应用如何共享、转让、公开披露您的个人信息 </b>
    </p>
    <p class="text-left">
      <b>
        1.共享：本应用不会向其他任何公司、组织和个人分享您的个人信息，但以下情况除外：
      </b>
      <br />
      <span class="ml-32">
        (1)在获取明确同意的情况下共享：获得您的明确同意后，本应用会与其他方共享您的个人信息。
      </span>
      <br />
      <span class="ml-32">
        (2)本应用可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。
      </span>
      <br />
      <span class="ml-32">
        (3)与本应用的关联公司（即同一集团下的其他公司）共享：您的个人信息可能会与本应用关联公司共享。本应用只会共享必要的个人信息，且受本隐私权政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。
      </span>
      <br />
      <span class="ml-32">
        (4)与授权合作伙伴共享：仅为实现本隐私权政策中声明的目的，本应用的某些服务将由授权合作伙伴提供。本应用可能会与合作伙伴共享您的相关设备信息（设备型号、软件系统版本、软件安装列表、Mac地址、唯一设备标识符（IMEI、IMSI、ICCID、Android_ID、IDFA）、IP、设备序列号）等，以提供更好的客户服务和用户个性化体验。例如，本应用合作的提供第三方数据统计和分析服务的公司可能需要采集和访问个人数据以进行数据统计和分析等服务。在这种情况下，这些公司必须遵守本应用的隐私权政策，采取同等的安全措施。本应用仅会共享提供服务所必须的个人信息，并要求其在完成处理目的后删除或匿名化处理数据。对本应用与之共享个人信息的公司、组织和个人，本应用会与其签署严格的保密协定，要求他们按照本应用的说明、本隐私权政策以及其他任何相关的保密和安全措施来处理个人信息。
      </span>
    </p>
    <p class="text-left">
      <b>
        2.转让：本应用不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外： </b
      ><br />
      <span class="ml-32">
        (1)在获取明确同意的情况下转让：获得您的明确同意后，本应用会向其他方转让您的个人信息； </span
      ><br />
      <span class="ml-32">
        (2)在涉及合并、收购或破产清算时，如涉及到个人信息转让，本应用会在要求新的持有您个人信息的公司、组织继续受此隐私权政策的约束，否则本应用将要求该公司、组织重新向您征求授权同意。
      </span>
    </p>
    <p class="text-left">
      <b>3.公开披露：本应用仅会在以下情况下，公开披露您的个人信息：</b><br />
      <span class="ml-32"> (1)获得您的明确同意后； </span><br />
      <span class="ml-32">
        (2)基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，本应用可能会公开披露您的个人信息； </span
      ><br />
      <span class="ml-32">
        (3)您知悉，即使已经取得您的授权同意，我们也仅会出于合法、正当、必要、特定、明确的目的公开披露您的个人信息，并尽量对公开披露内容中的个人信息进行去标识化处理。
      </span>
    </p>
    <p>
      <b>六、本应用如何保护您的个人信息</b>
    </p>
    <p class="text-left">
      1.本应用已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。本应用会采取一切合理可行的措施，保护您的个人信息。例如，在您的设备与服务之间交换数据时受SSL加密保护；相关网站提供https安全浏览方式；本应用会使用加密技术确保数据的保密性，采取受信赖的保护机制防止数据遭到恶意攻击；本应用会部署访问控制机制，确保只有授权人员才可访问个人信息；以及本应用会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
    </p>
    <p class="text-left">
      2.本应用会采取一切合理可行的措施，确保不收集与提供服务无关的个人信息。本应用只会在达成本政策所述目的所需的期限内保留您的个人信息，除非另有约定需要延长保留期或履行法律义务的前提下限期保留。
    </p>
    <p class="text-left">
      3.互联网并非绝对安全的环境，本应用将尽力确保或担保您发送给本应用的任何信息的安全性。如果本应用的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，本应用将承担相应的法律责任。
    </p>
    <p class="text-left">
      4.在不幸发生个人信息安全事件后，本应用将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、本应用已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。本应用将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，本应用将会采取合理、有效的方式发布公告。同时，本应用还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
    </p>
    <p>
      <b> 七、您的权利 </b>
    </p>
    <p class="text-left">
      按照马来西亚相关的法律、法规、标准，以及其他国家、地区的通行做法，
      <span style="color: red"
        >请您知悉：游客模式下，我们不记录任何您的个人信息，故我们亦无法向您提供任何信息访问、更正、删除、撤回授权、停止自动化决策等功能，同时也无任何个人信息副本的获取前提，故如您有上述请求，本应用无法响应。</span
      >
    </p>
    <p>
      <b>八、本隐私权政策如何更新</b>
    </p>
    <p class="text-left">
      本应用可能适时会对本隐私权政策进行调整或变更，本隐私权政策的任何更新将以标注更新时间的方式公布在本应用<span
        style="color: red"
        >或本应用官方</span
      >网站上，除法律法规或监管规定另有强制性规定外，经调整或变更的内容一经通知或公布后满7日即生效。<b
        >如果隐私权政策涉及个人信息处理类型、目的方式等等变更，我们会再次征得您的同意。</b
      >
    </p>
    <p>
      <b>九、如何联系本应用</b>
    </p>
    <p class="text-left">
      <b
        >如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与本应用联系：</b
      >
    </p>
    <p class="text-left">
      <b>公司：PLUM7 PTE. LTD.</b>
    </p>
    <p class="text-left text-flex">
      <b
        >公司注册地址：60 PAYA LEBAR ROAD #11-53 PAYA LEBAR SQUARE
        SINGAPORE(409051)</b
      >
    </p>
    <p class="text-left">
      <b>个人信息保护/信息安全部门联系方式：developer@weli.cn </b>
    </p>
    <p>
      <b> 十、隐私政策有效期及更新时间 </b>
    </p>
    <p class="text-left">
      <b
        >本隐私权政策于2023年11月1日更新，更新满7日后生效。本隐私权政策长期有效。</b
      >
    </p>
  </div>
</template>
<script>
import utils from '../../libs/utils';
export default {
  name: 'ikarma_privacy',
  data() {
    return {
      is_web: 0,
    };
  },
  created() {
    this.is_web = utils.getQueryString('is_web') ? 1 : 0;
    document.title = '隐私权协议';
  },
  mounted() {
    let title = document.getElementsByClassName('title')[0];
    let p = document.querySelectorAll('p');
    let b = document.querySelectorAll('b');
    title.style.color = this.is_web ? '#393939' : '#fff';
    p.forEach(item => {
      item.style.color = this.is_web ? '#393939' : '#fff';
    });
    b.forEach(item => {
      item.style.color = this.is_web ? '#393939' : '#fff';
    });
  },
};
</script>

<style>
.main {
  padding-left: 0.4rem;
  padding-right: 0.4rem;
  padding-bottom: 0.3rem;
  text-align: justify;
}

.title {
  margin-top: 0.6rem;
  font-size: 0.4rem;
  font-weight: bold;
  color: #fff;
}

p {
  /* margin-top: 0.4rem; */
  line-height: 1.5;
  font-size: 0.32rem;
  color: #fff;
}
a {
  text-decoration: none;
  color: #008bff;
}

b {
  color: #fff;
  font-weight: bold;
}
.text-center {
  text-align: center;
}
.text-left {
  text-indent: 0.64rem;
}
.text-flex {
  display: flex;
}
.ml-32 {
  margin-left: 0.32rem;
}

.text-line {
  text-decoration: underline;
}
</style>
