<template>
  <div>
    <div class="title text-center">
      <b> 用戶協議 </b>
    </div>
    <p class="text-left">
      <b>導言</b>
    </p>
    <p class="text-left"><b> 歡迎您使用「求真咨詢師」軟件及服務！ </b></p>
    <p class="text-left">
      <b>
        為使用求真咨詢師軟件（以下統稱「本軟件」）及服務，您應當閱讀並遵守《用戶協議》（以下簡稱「本協議」），以及《隱私權政策》。請您務必審慎閱讀、充分理解各條款內容，特別是免除或者限製平臺責任的條款、對用戶權利進行限製的條款、約定爭議解決方式和司法管轄的條款等，以及開通或使用某項服務的單獨協議。限製、免責條款或者其他涉及您重大權益的條款可能以加粗、加下劃線等形式提示您重點註意。
      </b>
    </p>
    <p class="text-left">
      <b>
        如果您因年齡、智力等因素而不具有完全民事行為能力，請在法定監護人（以下簡稱「監護人」）的陪同下閱讀和判斷是否同意本協議。如果您是馬來西亞地區以外的用戶，您訂立或履行本協議以及使用本服務的行為還需要同時遵守您所屬和/或所處國家或地區的法律。
      </b>
    </p>
    <p class="text-left">
      <b> 相關定義： </b>
    </p>
    <p class="text-left">
      <b> 平臺：指【COPILOT7 PTE. LTD.】及其相關服務可能存在的運營關聯單位。</b>
    </p>
    <p class="text-left">
      <b>
        求真咨詢師用戶：指註冊、登錄、使用求真咨詢師軟件及服務的個人、企業或其他組織。
      </b>
    </p>
    <p class="text-left">
      <b>
        前述「求真咨詢師用戶」統稱為「用戶」或「所有用戶」，在本協議中更多地稱為「您」。
      </b>
    </p>

    <p>
      <b> 一、【協議的範圍】 </b>
    </p>
    <p class="text-left">
      1.1 本協議是您與平臺之間關於您下載、安裝、使用、登錄本軟件，以及使用本服務所訂立的協議。
    </p>
    <p class="text-left">
      1.2 本協議的內容，包括但不限於以下與本軟件和/或本服務相關的協議、規則、規範以及平臺可能不斷發布的關於本軟件和/或本服務的相關協議、規則、規範等內容，前述內容一經正式發布，即為本協議不可分割的組成部分，與其構成統一整體，您同樣應當遵守。
    </p>
    <p>
      <b> 二、【關於本軟件和本服務】 </b>
    </p>
    <p class="text-left">
      2.1 本軟件是指平臺開發並按照本協議及平臺其他協議、規則之約定授權用戶下載、安裝、使用的<b>求真咨詢師</b>軟件。
    </p>
    <p class="text-left">
      2.2 您知曉並同意，平臺可能會根據需要更新或調整本服務的內容。
    </p>
    <p class="text-left">
      2.3 您可以通過電腦、手機等終端以客戶端、網頁等形式使用本服務，具體以平臺提供的為準，同時，平臺會不斷豐富您使用本服務的終端、形式等。當您使用本服務時，您應選擇與您的終端、系統等相匹配的本軟件版本，否則，您可能無法正常使用本服務。
    </p>
    <p class="text-left">
      2.4 平臺給予您一項不可轉讓及非排他性的許可，以按照本協議及平臺其他協議、規則限定的範圍和方式使用本軟件。
    </p>
    <p class="text-left ml-32">
      2.4.1 您可以為非商業目的在單一臺終端設備上下載、安裝、使用、登錄本軟件。
    </p>
    <p class="text-left ml-32">
      2.4.2 本條及本協議其他條款未明示授權的其他一切權利仍由平臺保留，您在行使這些權利時須另外取得平臺的書面許可。平臺如果未行使前述任何權利，並不構成對該權利的放棄。
    </p>
    <p class="text-left">
      2.5 平臺可能根據實際需要對本服務中收費服務的收費標準、方式進行修改和變更，平臺也可能會對部分免費服務開始收費。前述修改、變更或開始收費前，平臺將在相應服務頁面進行提前通知或公告。如果您不同意上述修改、變更或付費內容，您可以選擇停止使用該服務。
    </p>
    <p>
      <b> 三、【軟件的獲取】 </b>
    </p>
    <p class="text-left">
      3.1 您可以直接從平臺的官方網站、官方應用分發平臺以及平臺授權的第三方網站、應用分發平臺等平臺官方或平臺授權的渠道獲取本軟件。
    </p>
    <p class="text-left">
      3.1 您可以直接從平臺的官方網站、官方應用分發平臺以及平臺授權的第三方網站、應用分發平臺等平臺官方或平臺授權的渠道獲取本軟件。
    </p>
    <p><b> 四、【軟件的安裝與卸載】 </b></p>
    <p class="text-left">
      4.1 平臺可能為不同的終端、系統等開發不同的軟件版本，您應當根據實際情況選擇下載合適的版本進行安裝。
    </p>
    <p class="text-left">
      4.2 下載安裝程序後，您需要按照該程序提示的步驟正確安裝。
    </p>
    <p class="text-left">
      4.3 為提供更加優質、安全的服務，在本軟件安裝時平臺可能推薦您安裝其他軟件，您可以選擇安裝或不安裝。
    </p>
    <p class="text-left">
      4.4 因經營策略安排或調整等原因，不同地區的用戶可使用的具體平臺服務的內容可能會存在差異，具體以平臺實際提供的為準。
    </p>
    <p class="text-left">
      4.5 如果您不再需要使用本軟件或者需要安裝新版軟件，可以自行卸載。如果您願意幫助平臺改進產品服務，請告知卸載的原因。
    </p>
    <p>
      <b> 五、【軟件的更新】 </b>
    </p>
    <p class="text-left">
      5.1 為了增進用戶體驗、完善服務內容，平臺可能不斷努力開發新的服務，並為您不時提供軟件更新。
    </p>
    <p class="text-left">
      5.2 為了改善用戶體驗或提高服務安全性、保證功能的一致性等目的，平臺有權對本軟件進行更新，或者對軟件的部分功能效果進行改變。
    </p>
    <p class="text-left">
      5.3 本軟件新版本發布後，舊版本的軟件可能無法使用。平臺不保證舊版本軟件繼續可用，也不保證繼續對舊版本軟件提供相應的客服和維護服務，請您隨時核對並下載最新版本。
    </p>
    <p>
      <b> 六、【用戶信息及個人信息保護】 </b>
    </p>
    <p class="text-left">
      6.1 保護用戶信息是平臺的一項基本原則，平臺將在法律允許的範圍內按照本協議及<a
        href="privacy.html"
        target="_self"
        >《隱私權政策》</a
      >的規定收集、使用、儲存和分享您的相關信息。
    </p>
    <p class="text-left">
      6.2 您在註冊賬號或使用本服務的過程中，可能需要填寫一些必要的信息。若國家法律法規（本協議中的「法律法規」指用戶所屬/所處地區、國家現行有效的法律、行政法規、司法解釋、地方性法規、地方規章、部門規章及其他規範性文件以及對於該等法律法規的不時修改和補充，以及相關政策規定等，下同。）有特殊規定的，您需要填寫真實的身份信息（包括但不限於手機號等信息）。若您填寫的信息不完整或不真實，則可能無法使用本服務或在使用過程中受到限製。
    </p>
    <p class="text-left">
      <b>
        6.3 在您進行賬號註冊或使用本服務時，如發現您賬號可能存在涉詐、虛假註冊等異常情形或風險的，平臺有權根據相關法律法規規定重新核驗您的賬號，並可根據風險情況，采取限期改正、限製功能、暫停使用、關閉賬號、禁止重新註冊以及本協議規定的其他處置措施。在向您提供服務過程中，如發現涉詐、冒名頂替等違法犯罪線索、風險信息的，平臺有權依照國家有關規定移送公安、金融、電信、網信等主管部門。
      </b>
    </p>
    <p class="text-left">
      <b>
        6.4 在您使用平臺服務時，請務必妥善保管個人賬號及密碼，不得非法買賣、出租、出借個人賬號。如發現您的賬號可能存在異常情形或風險的，平臺有權根據相關法律法規規定重新核驗您的賬號。
      </b>
    </p>
    <p class="text-left">
      6.5 一般情況下，您可根據相關產品規則瀏覽、修改自己提交的信息。但出於安全性和身份識別（如賬號申訴服務等）的考慮，您可能無法修改註冊時提供的初始註冊信息及其他驗證信息。
    </p>
    <p class="text-left">
      6.6 平臺將運用各種安全技術和程序建立完善的管理製度來保護您的個人信息，以免遭受未經授權的訪問、使用或披露。
    </p>
    <p class="text-left">
      6.7 平臺遵照法律法規的規定，對信息的分享進行嚴格的限製。如果確有必要，將嚴格參照《隱私權政策》或其他相關規則執行。
    </p>
    <p class="text-left">
      6.8 平臺非常重視對未成年人個人信息的保護。<b>
        如果您是未成年人，請在法定監護人陪同下閱讀本協議及其他相關協議，並特別註意與未成年人使用相關的條款，在取得法定監護人的同意後，在法定監護人監護、指導下使用本服務。
      </b>
    </p>
    <p>
      <b> 七、【用戶行為規範】 </b>
    </p>
    <p>
      <span class="ml-32"> 7.1 【註冊及賬號使用】 </span>
      <br />
      <span class="ml-32"> 您充分理解並同意： </span>
      <br />
      <span class="ml-32"> 7.1.1 </span>

      用戶應當按照法律法規和服務要求，按相應頁面的提示準確提供並及時更新用戶的資料，以使之真實、及時、完整和準確。用戶不得冒充他人進行註冊，不得未經許可為他人註冊，不得以可能誤導其他用戶的方式註冊賬號，不得使用可能侵犯他人權益的用戶名進行註冊（包括但不限於涉嫌商標權、名譽權侵權等），不得以批量等方式惡意註冊賬號，否則平臺有權在發現後不予註冊或註銷該賬號，由此給用戶產生的損失應由用戶自行承擔。
    </p>
    <p>
      <span class="ml-32"> 7.1.2 </span>
      用戶須確認，在用戶完成註冊程序或以其他平臺允許的方式實際使用本服務時，個人用戶應當是具備完全民事行為能力的自然人，如不具備完全民事行為能力，則應征得監護人的明確同意後方能註冊成為本服務的個人用戶。若用戶不具備前述主體資格，請勿使用本服務，否則用戶及用戶的監護人應承擔因此而導致的一切後果，且平臺有權註銷、暫時凍結或永久凍結用戶的賬戶，給平臺造成損失的，平臺有權向用戶及相關用戶的監護人追償。
    </p>
    <p>
      <span class="ml-32"> 7.2 【用戶註意事項】 </span>
      <br />
      <span class="ml-32"> 您充分理解並同意： </span>
      <br />
      <span class="ml-32"> 7.2.1 </span>
      為了向您提供更好的服務或維護軟件安全的目的，平臺將按照法律法規規定的「合法、必要、正當」的原則獲取您的相關信息。
      <br />
      <span class="ml-32"> 7.2.2 </span>
      您在使用本服務某一特定功能時，可能還需同意單獨的協議、規則等，您在使用該項功能前請仔細閱讀前述相關協議、規則。
      <br />
      <span class="ml-32"> 7.2.3 </span>
      您可以選擇不向平臺提供您的某些信息，或者根據產品設置取消平臺收集某些信息的權利，但因此可能會導致相關服務功能無法實現。
      <br />
      <span class="ml-32"> 7.2.4 </span>
      平臺將會盡其商業上的合理努力保障您在本服務中的數據存儲安全，但是，平臺並不能就此提供完全保證，包括但不限於以下情形：
      <br />
      （1）平臺不對由於非平臺原因造成的您在本軟件和/或本服務中相關數據的刪除或儲存失敗負責。
      <br />
      （2）您應自行備份存儲在本軟件和/或本服務中的數據、信息或與本軟件和/或本服務相關的數據、信息，雙方另有約定的按相應約定執行。
      <br />
      （3）如果您停止使用本軟件和/或本服務（如註銷您的賬號時），或因您違反法律法規或本協議而被取消或終止本服務，平臺有權從服務器上永久地刪除您的數據。
    </p>
    <p>
      <b class="ml-32">7.3【用戶禁止行為】</b> <br />
      <b class="ml-32">
        您在使用本軟件和/或本服務的過程中，應遵守相關法律法規、用戶協議、規則規範等，不得從事包括但不限於以下任何行為，也不得為以下任何行為提供便利：
      </b>
      <br />
      <b class="ml-32"> 7.3.1 法律法規禁止的行為 </b>
      <br />
      <b class="ml-32">
        您理解並同意，平臺一直致力於為用戶提供文明健康、規範有序的網絡環境，您不得利用本服務賬號或功能賬號或本軟件及服務，製作、上傳、復製、發布、傳送、傳播或者轉載可能幹擾本服務正常運營，或侵犯其他主體合法權益，或者違反國家法律法規規定的內容，包括但不限於：
      </b>
      <br />
      <b>
        （1）反對憲法所確定的基本原則的；<br />
        （2）危害國家安全，泄露國家秘密，顛覆國家政權，破壞國家統一的；<br />
        （3）損害國家榮譽和利益的；<br />
        （4）歪曲、醜化、褻瀆、否定英雄烈士事跡和精神，以侮辱、誹謗或者其他方式侵害英雄烈士的姓名、肖像、名譽、榮譽的；<br />
        （5）宣揚恐怖主義、極端主義或者煽動實施恐怖活動、極端主義活動的；<br />
        （6）煽動民族仇恨、民族歧視，破壞民族團結的；<br />
        （7）破壞國家宗教政策，宣揚邪教和封建迷信的；<br />
        （8）散布謠言，擾亂社會秩序，破壞社會穩定的；<br />
        （9）散布淫穢、色情、賭博、暴力、恐怖或者教唆犯罪的；<br />
        （10）侮辱或者誹謗他人，侵害他人名譽、隱私和其他合法權益的；<br />
        （11）使用誇張標題，內容與標題嚴重不符的；<br />
        （12）炒作緋聞、醜聞、劣跡等的；<br />
        （13）不當評述自然災害、重大事故等災難的；<br />
        （14）帶有性暗示、性挑逗等易使人產生性聯想的；<br />
        （15）展現血腥、驚悚、殘忍等致人身心不適的；<br />
        （16）煽動人群歧視、地域歧視等的；<br />
        （17）宣揚低俗、庸俗、媚俗內容的；<br />
        （18）可能引發未成年人模仿不安全行為和違反社會公德行為、誘導未成年人不良嗜好等的；<br />
        （19）侵害未成年人合法權益或者損害未成年人身心健康的內容；<br />
        （20）煽動非法集會、結社、遊行、示威、聚眾擾亂社會秩序；<br />
        （21）以非法民間組織名義活動的；<br />
        （22）違反法律法規底線、社會主義製度底線、國家利益底線、公民合法權益底線、社會公共秩序底線、道德風尚底線和信息真實性底線的「七條底線」要求的；<br />
        （23）其他法律、行政法規禁止的或對網絡生態造成不良影響的內容。 
      </b>
    </p>
    <p>
      <span class="ml-32">7.3.2 軟件使用</span>
      <br />
      除非法律法規允許或平臺書面許可，您不得從事下列行為：<br />
      （1）刪除本軟件及其副本上關於著作權的信息。 <br />
      （2）對本軟件進行反向工程、反向匯編、反向編譯，或者以其他方式嘗試發現本軟件的源代碼。 <br />
      （3）對平臺擁有知識產權的內容進行使用、出租、出借、復製、修改、鏈接、轉載、匯編、發表、出版、建立鏡像站點等。 <br />
      （4）對本軟件或者本軟件運行過程中釋放到任何終端內存中的數據、軟件運行過程中客戶端與服務器端的交互數據，以及本軟件運行所必需的系統數據，進行復製、修改、增加、刪除、掛接運行或創作任何衍生作品，形式包括但不限於使用插件、外掛或非平臺經授權的第三方工具/服務接入本軟件和相關系統。 <br />
      （5）通過修改或偽造軟件運行中的指令、數據，增加、刪減、變動軟件的功能或運行效果，或者將用於上述用途的軟件、方法進行運營或向公眾傳播，無論這些行為是否為商業目的。 <br />
      （6）通過非平臺開發、授權的第三方軟件、插件、外掛、系統，登錄或使用本軟件和/或本服務，或製作、發布、傳播上述工具。 <br />
      （7）自行、授權他人或利用第三方軟件對本軟件和/或本服務及其組件、模塊、數據等進行幹擾。 <br />
      （8）其他可能影響、幹擾本軟件和/或本服務正常運行的行為。 
    </p>
    <p>
      <span class="ml-32"> 7.3.3 危害平臺安全內容</span>
      <br />
      您不得從事包括但不限於以下任何行為，也不得為以下任何行為提供便利：<br />
      （1）傳播虛假中獎信息、釣魚欺詐信息、非法或虛假理財信息等非法、詐騙或虛假信息。 <br />
      （2）傳播包含病毒、木馬等的文件、程序或相應製作教程等的內容、信息。 <br />
      （3）其他危害平臺、本軟件或其他主體安全的內容、信息或行為。 
    </p>
    <p class="text-left">7.4 【法律責任】</p>
    <p class="text-left">
      7.4.1
      您理解並同意：若您違反法律法規、本協議和/或平臺其他協議、規則的，平臺有權隨時單方根據相應情形采取以下一項或多項措施（具體措施的時間長短由平臺根據您的違法違約情節相應情況確定）：
      <br />
      （1）對您進行警告。<br />
      （2）限製您使用本軟件和/或本服務部分或全部功能。<br />
      （3）刪除、屏蔽相關內容或斷開鏈接。<br />
      （4）中止、終止您對相應中求真咨詢師賬號的使用（簡稱「封號」）。<br />
      （5）采取其他合理、合法的措施。<br />
      （6）依法追究您的法律責任。 
    </p>
    <p class="text-left">
      7.4.2
      如果您違反法律法規、本協議和/或平臺其他協議、規則，平臺對您或您使用的本軟件和/或本服務采取任何行為或措施後，導致您暫時或永久無法使用<b>求真咨詢師</b>、無法使用<b>求真咨詢師</b>登錄或使用其他產品和/或服務，您應自行承擔相應後果，由此造成您損失的，您應自行承擔。
    </p>
    <p class="text-left">
      7.4.3
      您應自行對因使用本服務而產生或存儲在本服務中的數據，在本服務之外，采取合理、安全的備份。若平臺根據本協議對您采取永久封號等措施的，對於您的與本服務相關的全部數據或您存儲在本服務中的全部數據、信息等，平臺有權將該等數據全部予以刪除，相應後果您應自行承擔。
    </p>
    <p class="text-left">
      7.4.4 您導致任何第三方損害的，您應當獨立承擔責任；平臺因此遭受損失的，您也應當一並賠償。
    </p>
    <p class="text-left">
      7.5 【對自己行為負責】<br />
      您充分了解並同意，您必須為自己使用本軟件和/或本服務的一切行為負責，包括您所發表的任何內容以及由此產生的任何後果。您應對使用本軟件和/或本服務時接觸到的內容自行加以判斷，包括因對內容的正確性、完整性或實用性的依賴而產生的風險，並承擔由此引起的相應風險。平臺在法律允許的範圍內不對您因前述風險而導致的任何損失或損害承擔責任。
    </p>
    <p class="text-left">
      <b>
        如您為不具有完全民事行為能力的自然人，您應理解，您的監護人將對您使用本服務的一切行為負責。
      </b>
    </p>
    <p class="text-left">7.6 【用戶發送/傳播違規內容與投訴處理】</p>
    <p class="text-left">
      7.6.1
      未經授權和許可，用戶不得利用<b>求真咨詢師</b>上傳、儲存、共享、傳播含有受到知識產權法律保護的圖像、相片、視頻、軟件或其他數據資料、文件。用戶違反相關知識產權保護法律、規範，侵害第三方合法權益的，均由用戶自行承擔責任，給平臺造成損失的應當賠償。
    </p>
    <p class="text-left">
      <b>
        7.6.2
        如您被他人投訴或您投訴他人，平臺有權依法保存有關信息，並將爭議中相關方的主體、聯系方式、投訴相關內容等必要信息提供給相關當事方或相關部門，配合調查處理等，用戶應獨自承擔由此而產生的一切法律責任。
      </b>
    </p>
    <p>
      <b> 八、【第三方提供的產品或服務】 </b>
    </p>
    <p class="text-left">
      8.1
      您在平臺上使用第三方提供的產品或服務時，除遵守本協議約定外，還應遵守第三方的用戶協議，我們建議您在使用該種第三方產品或服務前仔細閱讀其用戶協議及隱私權政策。平臺和第三方對可能出現的糾紛在法律規定和約定的範圍內各自承擔責任。
    </p>
    <p class="text-left">
      8.2
      因用戶使用本軟件或要求平臺提供特定服務時，本軟件可能會調用第三方系統或者通過第三方支持用戶的使用或訪問，使用或訪問的結果由該第三方提供（包括但不限於您通過本服務跳轉到的第三方提供的服務及內容，第三方通過平臺開放平臺接入的服務及內容等），平臺不對該種第三方提供的服務負責。
    </p>
    <p>
      <b>九、【廣告】及【付費】</b>
    </p>
    <p class="text-left">
      9.1
      您同意平臺可以自行或由第三方通過短信、電子郵件或電子信息等多種方式向您發送、展示廣告或其他信息（包括商業與非商業信息），廣告或其他信息的具體發送及展示形式、頻次及內容等以平臺實際提供為準。
    </p>
    <p class="text-left">
      9.2
      平臺將依照相關法律法規要求開展廣告業務。您同意，對本服務中出現的廣告，您應審慎判斷其真實性和可靠性，除法律明確規定外，您應對因該廣告而實施的行為負責。
    </p>
    <p class="text-left">
      9.3
      為了提供更好的服務體驗，我們將陸續完善服務細則，提供豐富的服務內容，具體內容及服務類別以您使用<b>求真咨詢師</b>時顯示的頁面為準。關於「<b>求真咨詢師</b>付費系列服務」，為您提供如下簡介：
      <br />
      <span class="ml-32"> 【單項服務訂購】</span>
      <br />
      <span class="ml-32">
        我們將不定期推出單項服務，您可在相應的購買界面查閱訂購資格、服務金額、服務內容、服務期限等細則，您閱讀無誤後可選擇付費購買，享受相應的單項服務。
      </span>
    </p>
    <p>
      <b>十、【知識產權】</b>
    </p>
    <p class="text-left">
      10.1
      平臺是本軟件的知識產權權利人。本軟件的著作權、商標權、專利權、商業秘密等知識產權，以及與本軟件相關的所有信息內容（包括但不限於文字、圖片、音頻、視頻、圖表、界面設計、版面框架、有關數據或電子文檔等）均受法律法規和相應的國際條約保護，平臺依法享有上述相關知識產權，但相關權利人依照法律規定應享有的權利除外。
    </p>
    <p class="text-left">
      10.2
      未經平臺或相關權利人書面同意，您不得為任何商業或非商業目的自行或許可任何第三方實施、利用、轉讓上述知識產權。
    </p>
    <p>十一、【終端安全責任】</p>
    <p class="text-left">
      11.1
      您理解並同意，本軟件和/或本服務同大多數互聯網軟件、服務一樣，可能會受多種因素影響（包括但不限於用戶原因、網絡服務質量、社會環境等）；也可能會受各種安全問題的侵擾（包括但不限於他人非法利用用戶資料，進行現實中的騷擾；用戶下載安裝的其他軟件或訪問的其他網站中可能含有病毒、木馬程序或其他惡意程序，威脅您終端的信息和數據的安全，繼而影響本軟件、本服務的正常使用等），因此，您應加強信息安全及個人信息的保護意識，註意密碼保護，以免遭受損失。
    </p>
    <p class="text-left">
      11.2
      您不得製作、發布、使用、傳播用於竊取<b>求真咨詢師</b>號碼和/或他人個人信息、財產的惡意程序。
    </p>
    <p class="text-left">
      11.3
      維護軟件安全與正常使用是平臺和您的共同責任，平臺將按照行業標準合理審慎地采取必要技術措施保護您的終端信息和數據安全，但是您承認和同意平臺不能就此提供任何保證。
    </p>
    <p>
      <b> 十二、【第三方軟件或技術】 </b>
    </p>
    <p class="text-left">
      12.1 本軟件可能會使用第三方軟件或技術（包括本軟件可能使用的開源代碼和公共領域代碼等，下同），這種使用已經獲得合法授權。
    </p>
    <p class="text-left">
      12.2 本軟件如果使用了第三方的軟件或技術，平臺將按照相關法規或約定，對相關的協議或其他文件，可能通過本協議附件、在本軟件安裝包特定文件夾中打包等形式進行展示，它們可能會以「軟件使用許可協議」「授權協議」「開源代碼許可證」或其他形式來表達。
    </p>
    <p class="text-left">
      12.3 前述通過各種形式展現的相關協議或其他文件，均是本協議不可分割的組成部分，與本協議具有同等的法律效力，您應當遵守這些要求。如果您沒有遵守這些要求，該第三方或者國家機關可能會對您提起訴訟、罰款或采取其他製裁措施，並要求平臺給予協助，您應當自行承擔法律責任。
    </p>
    <p>
      <b> 十三、【不可抗力及其他免責事由】 </b>
    </p>
    <p class="text-left">
      13.1
      您理解並同意，在使用本服務的過程中，可能會遇到不可抗力等風險因素，使本服務受到影響。不可抗力是指不能預見、不能克服並不能避免且對一方或雙方造成重大影響的客觀事件，包括但不限於自然災害如洪水、地震、瘟疫流行和風暴等以及社會事件如戰爭、動亂、政府行為等。出現上述情況時，平臺將努力在第一時間與相關單位配合，爭取及時進行處理，但是由此給您造成的損失平臺在法律允許的範圍內免責。
    </p>
    <p class="text-left">
      13.2 在法律允許的範圍內，平臺對以下情形導致的服務中斷或受阻不承擔責任：<br />
      （1）受到計算機病毒、木馬或其他惡意程序、黑客攻擊的破壞。 <br />
      （2）用戶或平臺的電腦軟件、系統、硬件和通信線路出現故障。 <br />
      （3）用戶操作不當或用戶通過非平臺授權的方式使用本服務。 <br />
      （4）程序版本過時、設備的老化和/或其兼容性問題。 <br />
      （5）其他平臺無法控製或合理預見的情形。 
    </p>
    <p class="text-left">
      13.3
      您理解並同意，在使用本服務的過程中，可能會遇到網絡信息或其他用戶行為帶來的風險，平臺不對任何信息的真實性、適用性、合法性承擔責任，也不對因侵權行為給您造成的損害負責。這些風險包括但不限於：<br />
      （1）來自他人匿名或冒名的含有威脅、誹謗、令人反感或非法內容的信息。 <br />
      （2）遭受他人誤導、欺騙或其他導致或可能導致的任何心理、生理上的傷害以及經濟上的損失。 <br />
      （3）其他因網絡信息或用戶行為引起的風險。 
    </p>
    <p class="text-left">
      13.4
      平臺依據本協議約定獲得處理違法違規內容的權利，該權利不構成平臺的義務或承諾，平臺不能保證及時發現違法行為或進行相應處理。
    </p>
    <p class="text-left">
      13.5
      在任何情況下，您不應輕信借款、索要密碼或其他涉及財產的信息。涉及財產操作的，請一定先核實對方身份，並請經常留意平臺有關防範詐騙犯罪的提示。
    </p>
    <p>
      <b> 十四、【其他】 </b>
    </p>
    <p class="text-left">
      14.1
      您使用本軟件和/或本服務即視為您已閱讀本協議並接受本協議的約束。平臺有權在必要時修改本協議條款。您可以在相關服務頁面查閱最新版本的協議條款。本協議條款變更後，如果您繼續使用平臺提供的軟件或服務，即視為您已接受變更後的協議。
    </p>
    <p class="text-left">14.2 本協議簽訂地為新加坡國。</p>
    <p class="text-left">
      14.3
      本協議的成立、生效、履行、解釋及糾紛解決，適用平臺所在地法律（不包括沖突法）。
    </p>
    <p class="text-left">
      14.4
      若您和平臺之間發生任何糾紛或爭議，首先應友好協商解決；協商不成的，您同意將糾紛或爭議提交平臺所在地有管轄權的人民法院管轄。
    </p>
    <p class="text-left">
      14.5
      本協議所有條款的標題僅為閱讀方便，本身並無實際含義，不能作為本協議涵義解釋的依據。
    </p>
    <p class="text-left">
      14.6
      本協議條款無論因何種原因部分無效或不可執行，其余條款仍有效，對雙方具有約束力。
    </p>
    <p class="text-left">
      14.7
      若本協議有中文、英文等多個語言版本，相應內容不一致的，均以中文版的內容為準。
    </p>
    <p>
      <b> 十五、【聯系我們】 </b>
    </p>
    <p class="text-left">
      <b>
        15.1
        當您對我們的產品有相關建議或者有其它相關事宜需要我們協助，或需對發現的違規內容進行投訴、舉報，可通過求真咨詢師客戶端，進入「我的」-「設置」-「聯系我們」向我們反饋，我們將盡快審核所涉問題，並在法律法規規定的期限內回復您的請求。
      </b>
    </p>
  </div>
</template>

<style>
.title {
  margin-top: 0.6rem;
  font-size: 0.4rem;
  font-weight: bold;
  color: #393939;
}

p {
  /* margin-top: 0.4rem; */
  line-height: 1.5;
  font-size: 0.32rem;
  color: #666;
}
a {
  text-decoration: none;
  color: #008bff;
}

b {
  color: #2a2a2a;
  font-weight: bold;
}
.text-center {
  text-align: center;
}
.text-left {
  text-indent: 0.64rem;
}
.text-flex {
  display: flex;
}
.ml-32 {
  margin-left: 0.32rem;
}
</style>
