<!--
 * @Author: wujiang@weli.cn
 * @Date: 2024-01-10 15:48:49
 * @LastEditors: wujiang 
 * @LastEditTime: 2024-01-11 18:40:22
 * @Description: 
-->
<template>
  <div class="main">
    <div class="title text-center">
      <b> 用户协议 </b>
    </div>
    <p class="text-left">
      <b>导言</b>
    </p>
    <p class="text-left"><b> 欢迎您使用“iKarma”软件及服务！ </b></p>
    <p class="text-left">
      <b>
        为使用iKarma软件（以下统称“本软件”）及服务，您应当阅读并遵守《用户协议》（以下简称“本协议”），以及《隐私权政策》。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制平台责任的条款、对用户权利进行限制的条款、约定争议解决方式和司法管辖的条款等，以及开通或使用某项服务的单独协议。限制、免责条款或者其他涉及您重大权益的条款可能以加粗、加下划线等形式提示您重点注意。
      </b>
    </p>
    <p class="text-left">
      <b>
        如果您因年龄、智力等因素而不具有完全民事行为能力，请在法定监护人（以下简称“监护人”）的陪同下阅读和判断是否同意本协议。如果您是马来西亚地区以外的用户，您订立或履行本协议以及使用本服务的行为还需要同时遵守您所属和/或所处国家或地区的法律。
      </b>
    </p>
    <p class="text-left">
      <b> 相关定义： </b>
    </p>
    <p class="text-left">
      <b> 平台：指【PLUM7 PTE. LTD.】及其相关服务可能存在的运营关联单位。 </b>
    </p>
    <p class="text-left">
      <b>
        iKarma用户：指注册、登录、使用iKarma软件及服务的个人、企业或其他组织。
      </b>
    </p>
    <p class="text-left">
      <b>
        前述“iKarma用户”统称为“用户”或“所有用户”，在本协议中更多地称为“您”。
      </b>
    </p>

    <p>
      <b> 一、【协议的范围】 </b>
    </p>
    <p class="text-left">
      1.1
      本协议是您与平台之间关于您下载、安装、使用、登录本软件，以及使用本服务所订立的协议。
    </p>
    <p class="text-left">
      1.2
      本协议的内容，包括但不限于以下与本软件和/或本服务相关的协议、规则、规范以及平台可能不断发布的关于本软件和/或本服务的相关协议、规则、规范等内容，前述内容一经正式发布，即为本协议不可分割的组成部分，与其构成统一整体，您同样应当遵守。
    </p>
    <p>
      <b> 二、【关于本软件和本服务】 </b>
    </p>
    <p class="text-left">
      2.1
      本软件是指平台开发并按照本协议及平台其他协议、规则之约定授权用户下载、安装、使用的<b>iKarma</b>软件。
    </p>
    <p class="text-left">
      2.2 您知晓并同意，平台可能会根据需要更新或调整本服务的内容。
    </p>
    <p class="text-left">
      2.3
      您可以通过电脑、手机等终端以客户端、网页等形式使用本服务，具体以平台提供的为准，同时，平台会不断丰富您使用本服务的终端、形式等。当您使用本服务时，您应选择与您的终端、系统等相匹配的本软件版本，否则，您可能无法正常使用本服务。
    </p>
    <p class="text-left">
      2.4
      平台给予您一项不可转让及非排他性的许可，以按照本协议及平台其他协议、规则限定的范围和方式使用本软件。
    </p>
    <p class="text-left ml-32">
      2.4.1 您可以为非商业目的在单一台终端设备上下载、安装、使用、登录本软件。
    </p>
    <p class="text-left ml-32">
      2.4.2
      本条及本协议其他条款未明示授权的其他一切权利仍由平台保留，您在行使这些权利时须另外取得平台的书面许可。平台如果未行使前述任何权利，并不构成对该权利的放弃。
    </p>
    <p class="text-left">
      2.5
      平台可能根据实际需要对本服务中收费服务的收费标准、方式进行修改和变更，平台也可能会对部分免费服务开始收费。前述修改、变更或开始收费前，平台将在相应服务页面进行提前通知或公告。如果您不同意上述修改、变更或付费内容，您可以选择停止使用该服务。
    </p>
    <p>
      <b> 三、【软件的获取】 </b>
    </p>
    <p class="text-left">
      3.1
      您可以直接从平台的官方网站、官方应用分发平台以及平台授权的第三方网站、应用分发平台等平台官方或平台授权的渠道获取本软件。
    </p>
    <p class="text-left">
      3.2
      如果您从未经平台授权的第三方获取本软件或与本软件名称相同的安装程序，平台无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。
    </p>
    <p><b> 四、【软件的安装与卸载】 </b></p>
    <p class="text-left">
      4.1
      平台可能为不同的终端、系统等开发不同的软件版本，您应当根据实际情况选择下载合适的版本进行安装。
    </p>
    <p class="text-left">
      4.2下载安装程序后，您需要按照该程序提示的步骤正确安装。
    </p>
    <p class="text-left">
      4.3
      为提供更加优质、安全的服务，在本软件安装时平台可能推荐您安装其他软件，您可以选择安装或不安装。
    </p>
    <p class="text-left">
      4.4
      因经营策略安排或调整等原因，不同地区的用户可使用的具体平台服务的内容可能会存在差异，具体以平台实际提供的为准。
    </p>
    <p class="text-left">
      4.5
      如果您不再需要使用本软件或者需要安装新版软件，可以自行卸载。如果您愿意帮助平台改进产品服务，请告知卸载的原因。
    </p>
    <p>
      <b> 五、【软件的更新】 </b>
    </p>
    <p class="text-left">
      5.1
      为了增进用户体验、完善服务内容，平台可能不断努力开发新的服务，并为您不时提供软件更新。
    </p>
    <p class="text-left">
      5.2
      为了改善用户体验或提高服务安全性、保证功能的一致性等目的，平台有权对本软件进行更新，或者对软件的部分功能效果进行改变。
    </p>
    <p class="text-left">
      5.3
      本软件新版本发布后，旧版本的软件可能无法使用。平台不保证旧版本软件继续可用，也不保证继续对旧版本软件提供相应的客服和维护服务，请您随时核对并下载最新版本。
    </p>
    <p>
      <b> 六、【用户信息及个人信息保护】 </b>
    </p>
    <p class="text-left">
      6.1
      保护用户信息是平台的一项基本原则，平台将在法律允许的范围内按照本协议及<a
        href="ikarma_privacy.html"
        target="_self"
        >《隐私权政策》</a
      >的规定收集、使用、储存和分享您的相关信息。
      个人信息是以电子或者其他方式记录的与已识别或者可识别的自然人有关的各种信息，不包括匿名化处理后的信息。游客模式下，我们不收取任何可以识别特定自然人身份的信息。
    </p>

    <p>
      <b> 七、【用户行为规范】 </b>
    </p>
    <p>
      <span class="ml-32"> 7.1 【使用】 </span>
      <br />
      <span class="ml-32"> 您充分理解并同意： </span>
      <br />
      <span class="ml-32"> 7.1.1 </span>
      本产品仅提供游客模式，您无需在使用本产品前注册任何账号，提供任何信息。
    </p>
    <p>
      <span class="ml-32"> 7.1.2 </span>
      用户须确认，在实际使用本服务时，个人用户应当是具备完全民事行为能力的自然人，如不具备完全民事行为能力，则应征得监护人的明确同意后成为本服务的个人用户。若用户不具备前述主体资格，请勿使用本服务，否则用户及用户的监护人应承担因此而导致的一切后果。
    </p>
    <p>
      <span class="ml-32"> 7.2 【用户注意事项】 </span>
      <br />
      <span class="ml-32">
        您充分理解并同意，平台将会尽其商业上的合理努力保障您在本服务中的数据存储安全，但是，平台并不能就此提供完全保证，包括但不限于以下情形：</span
      >
      <br />
      <span class="ml-32"> 7.2.1 </span>
      鉴于本服务仅提供游客模式，您在使用过程中无所属账号，故平台不记录您的任何使用痕迹。请您使用时自行保管。平台不对任何原因造成的您在本软件和/或本服务中相关数据的删除或储存失败负责。在此前提下，平台亦无需向您提供账号注销功能。
    </p>
    <p>
      <b class="ml-32">7.3【用户禁止行为】</b> <br />
      <b class="ml-32">
        您在使用本软件和/或本服务的过程中，应遵守相关法律法规、用户协议、规则规范等，不得从事包括但不限于以下任何行为，也不得为以下任何行为提供便利：
      </b>
      <br />
      <b class="ml-32"> 7.3.1 法律法规禁止的行为 </b>
      <br />
      <b class="ml-32">
        您理解并同意，平台一直致力于为用户提供文明健康、规范有序的网络环境，您不得利用本服务进行任何可能干扰本服务正常运营，或侵犯其他主体合法权益，或者违反国家法律法规规定的内容，包括但不限于：
      </b>
      <br />
      <b>
        （1）反对宪法所确定的基本原则的；<br />
        （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br />
        （3）损害国家荣誉和利益的；<br />
        （4）歪曲 、丑化 、亵渎 、否定 英雄烈士 事迹和精神 ，以 侮辱 、诽谤
        或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；<br />
        （5）宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；<br />
        （6）煽动民族仇恨、民族歧视，破坏民族团结的；<br />
        （7）破坏国家宗教政策，宣扬邪教和封建迷信的；<br />
        （8）散布谣言，扰乱社会秩序，破坏社会稳定的；<br />
        （9）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；<br />
        （10）侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；<br />
        （11）使用夸张标题，内容与标题严重不符的；<br />
        （12）炒作绯闻、丑闻、劣迹等的；<br />
        （13）不当评述自然灾害、重大事故等灾难的；<br />
        （14）带有性暗示、性挑逗等易使人产生性联想的；<br />
        （15）展现血腥、惊悚、残忍等致人身心不适的；<br />
        （16）煽动人群歧视、地域歧视等的；<br />
        （17）宣扬低俗、庸俗、媚俗内容的；<br />
        （18）可能引发未成年人模仿不安全行为和违反社会公德行为、诱导未成年人不良嗜好等的；<br />
        （19）侵害未成年人合法权益或者损害未成年人身心健康的内容；<br />
        （20）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；<br />
        （21）以非法民间组织名义活动的；<br />
        （22）违反法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的；<br />
        （23）其他法律、行政法规禁止的或对网络生态造成不良影响的内容。
      </b>
    </p>
    <p>
      <span class="ml-32">7.3.2 软件使用</span>
      <br />
      除非法律法规允许或平台书面许可，您不得从事下列行为：<br />
      （1）删除本软件及其副本上关于著作权的信息。<br />
      （2）对本软件进行反向工程、反向汇编、反向编译
      ，或者以其他方式尝试发现本软件的源代码。<br />
      （3）对平台拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等。<br />
      （4）对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非平台经授权的第三方工具/服务接入本软件和相关系统。<br />
      （5）通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播
      ，无论这些行为是否为商业目的。<br />
      （6）通过非平台开发、授权的第三方软件、插件、外挂、系统，登录或使用本软件和/或本服务，或制作、发布、传播上述工具。<br />
      （7）自行、授权他人或利用第三方软件对本软件和/或本服务及其组件、模块、数据等进行干扰。<br />
      （8）其他可能影响、干扰本软件和/或本服务正常运行的行为。
    </p>
    <p>
      <span class="ml-32"> 7.3.3 【法律责任】</span>
      <br />

      <span class="ml-32">7.3.3.1</span>
      您理解并同意：若您违反法律法规、本协议和/或平台其他协议、规则的，平台有权随时单方采取其他合理、合法的措施并依法追究您的法律责任。<br />
      <span class="ml-32">7.3.3.2</span>
      本平台不记录任何您的使用信息，您应自行对因使用本服务而产生的数据，在本服务之外，采取合理、安全的备份。<br />
      <span class="ml-32">7.3.3.3</span>
      您导致任何第三方损害的，您应当独立承担责任；平台因此遭受损失的，您也应当一并赔偿。<br />
    </p>
    <p class="text-left">7.4 【对自己行为负责】</p>
    <p class="text-left">
      您充分了解并同意，您必须为自己使用本软件和/或本服务的一切行为负责，包括您所发表的任何内容以及由此产生的任何后果。您应对使用本软件和/或本服务时接触到的内容自行加以判断，包括因对内容的正确性、完整性或实用性的依赖而产生的风险，并承担由此引起的相应风险。平台在法律允许的范围内不对您因前述风险而导致的任何损失或损害承担责任。
    </p>
    <p class="text-left">
      <b>
        如您为不具有完全民事行为能力的自然人，您应理解，您的监护人将对您使用本服务的一切行为负责。
      </b>
    </p>

    <p>
      <b> 八、【第三方提供的产品或服务】 </b>
    </p>
    <p class="text-left">
      8.1
      您在平台上使用第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议，我们建议您在使用该种第三方产品或服务前仔细阅读其用户协议及隐私权政策。平台和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。
    </p>
    <p class="text-left">
      8.2
      因用户使用本软件或要求平台提供特定服务时，本软件可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供（包括但不限于您通过本服务跳转到的第三方提供的服务及内容，第三方通过平台开放平台接入的服务及内容等），平台不对该种第三方提供的服务负责。
    </p>
    <p>
      <b>九、【知识产权】</b>
    </p>
    <p class="text-left">
      9.1
      平台是本软件的知识产权权利人。本软件的著作权、商标权、专利权、商业秘密等知识产权，以及与本软件相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受法律法规和相应的国际条约保护，平台依法享有上述相关知识产权，但相关权利人依照法律规定应享有的权利除外。
    </p>
    <p class="text-left">
      9.2
      未经平台或相关权利人书面同意，您不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。
    </p>

    <p>
      <b>十、【终端安全责任】</b>
    </p>
    <p class="text-left">
      10.1
      您理解并同意，本软件和/或本服务同大多数互联网软件、服务一样，可能会受多种因素影响（包括但不限于网络服务质量、社会环境等）；也可能会受各种安全问题的侵扰（用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您终端的信息和数据的安全，继而影响本软件、本服务的正常使用等），因此，您应加强安全意识，以免遭受损失。维护软件安全与正常使用是平台和您的共同责任，平台将按照行业标准合理审慎地采取必要技术措施对软件安全进行保护，但是您承认和同意平台不能就此提供任何保证。
    </p>
    <p>
      <b> 十一、【第三方软件或技术】 </b>
    </p>
    <p class="text-left">
      11.1
      本软件可能会使用第三方软件或技术（包括本软件可能使用的开源代码和公共领域代码等，下同），这种使用已经获得合法授权。
    </p>
    <p class="text-left">
      11.2
      本软件如果使用了第三方的软件或技术，平台将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本软件安装包特定文件夹中打包等形式进行展示，它们可能会以“软件使用许可协议”“授权协议”“开源代码许可证”或其他形式来表达。
    </p>
    <p class="text-left">
      11.3
      前述通过各种形式展现的相关协议或其他文件，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，您应当遵守这些要求。如果您没有遵守这些要求，该第三方或者国家机关可能会对您提起诉讼、罚款或采取其他制裁措施，并要求平台给予协助，您应当自行承担法律责任。
    </p>
    <p>
      <b> 十二、【不可抗力及其他免责事由】 </b>
    </p>
    <p class="text-left">
      12.1
      您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务受到影响。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，平台将努力在第一时间与相关单位配合，争取及时进行处理，但是由此给您造成的损失平台在法律允许的范围内免责。
    </p>
    <p class="text-left">
      12.2 在法律允许的范围内，平台对以下情形导致的服务中断或受阻不承担责任：<br />
      （1）受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏。<br />
      （2）用户或平台的电脑软件、系统、硬件和通信线路出现故障。<br />
      （3）用户操作不当或用户通过非平台授权的方式使用本服务。<br />
      （4）程序版本过时、设备的老化和/或其兼容性问题。<br />
      （5）其他平台无法控制或合理预见的情形。
    </p>
    <p>
      <b> 十三、【其他】 </b>
    </p>
    <p class="text-left">
      13.1
      您使用本软件和/或本服务即视为您已阅读本协议并接受本协议的约束。平台有权在必要时修改本协议条款。您可以在相关服务页面查阅最新版本的协议条款。本协议条款变更后，如果您继续使用平台提供的软件或服务，即视为您已接受变更后的协议。
    </p>
    <p class="text-left text-line">13.2 本协议签订地为新加坡国。</p>
    <p class="text-left text-line">
      13.3
      本协议的成立、生效、履行、解释及纠纷解决，适用平台所在地法律（不包括冲突法）。
    </p>
    <p class="text-left text-line">
      13.4
      若您和平台之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交平台所在地有管辖权的人民法院管辖。
    </p>
    <p class="text-left">
      13.5
      本协议所有条款的标题仅为阅读方便，本身并无实际含义，不能作为本协议涵义解释的依据。
    </p>
    <p class="text-left">
      13.6
      本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
    </p>
    <p class="text-left">
      13.7
      若本协议有中文、英文等多个语言版本，相应内容不一致的，均以中文版的内容为准。
    </p>
    <p>
      <b> 十四、【联系我们】 </b>
    </p>
    <p class="text-left">
      <b>
        14.1
        当您对我们的产品有相关建议或者有其它相关事宜需要我们协助，或需对发现的违规内容进行投诉、举报，可通过iKarma客户端，进入“我的”-“设置”-“联系我们”向我们反馈，我们将尽快审核所涉问题，并在法律法规规定的期限内回复您的请求。
      </b>
    </p>
  </div>
</template>
<script>
import utils from '../../libs/utils';
export default {
  name: 'ikarma_user_agreement',
  data() {
    return {
      is_web: 0,
    };
  },
  created() {
    this.is_web = utils.getQueryString('is_web') ? 1 : 0;
    document.title = '用户协议';
  },
  mounted() {
    let title = document.getElementsByClassName('title')[0];
    let p = document.querySelectorAll('p');
    let b = document.querySelectorAll('b');
    title.style.color = this.is_web ? '#393939' : '#fff';
    p.forEach(item => {
      item.style.color = this.is_web ? '#393939' : '#fff';
    });
    b.forEach(item => {
      item.style.color = this.is_web ? '#393939' : '#fff';
    });
  },
};
</script>

<style>
.main {
  padding-left: 0.4rem;
  padding-right: 0.4rem;
  padding-bottom: 0.3rem;
  text-align: justify;
}

.title {
  margin-top: 0.6rem;
  font-size: 0.4rem;
  font-weight: bold;
  color: #fff;
}

p {
  /* margin-top: 0.4rem; */
  line-height: 1.5;
  font-size: 0.32rem;
  color: #fff;
}
a {
  text-decoration: none;
  color: #008bff;
}

b {
  color: #fff;
  font-weight: bold;
}
.text-center {
  text-align: center;
}
.text-left {
  text-indent: 0.64rem;
}
.text-flex {
  display: flex;
}
.ml-32 {
  margin-left: 0.32rem;
}

.text-line {
  text-decoration: underline;
}
</style>
