<template>
  <div>
    <div class="title text-center">
      <b> 隱私權政策 </b>
    </div>
    <p class="text-left">
      歡迎您使用「命理尋真」（以下簡稱「本應用」）軟件及相關服務。如您未明示同意本隱私權政策，我們無法為您提供完整的產品和服務。如果您同意了本隱私權政策後使用應用，我們將視為您接受和認可我們按照本政策對您的相關信息進行處理，並基於提供的具體產品和服務收集使用相應的個人信息。
    </p>
    <p class="text-left">
      本應用深知個人信息對您的重要性，並會盡遵守合法、正當、必要、誠信的原則處理您的個人信息。本應用將按業界成熟的安全標準，采取相應的安全保護措施來保護您的個人信息。
    </p>
    <p class="text-left">
      <b>
        請您在使用本應用及相關服務前仔細閱讀並理解本政策，在確認充分理解並同意後使用本應用及相關服務。本政策有關您個人信息權益的條款我們已采取加粗形式提示，請您特別關註並重點閱讀。
      </b>
    </p>
    <p>一、本應用如何收集和使用您的個人信息</p>
    <p class="text-left">
      個人信息是以電子或者其他方式記錄的與已識別或者可識別的自然人有關的各種信息，不包括匿名化處理後的信息。
    </p>
    <p>本應用僅會處於本政策所述的以下目的，收集和使用您的個人信息：</p>
    <p class="text-left">
      <b>
        1.當您使用本應用運行期間，我們會通過收集您的設備型號、軟件系統版本、軟件安裝列表、Mac地址、BSSID、唯一設備標識符（IMEI、IMSI、ICCID、Android_ID、IDFA）、IP、設備序列號、SIM序列號、藍牙地址來標識唯一用戶，從而進行統計分析以便我們為您提供信息展示的最優方案。此外，基於數據統計需要，我們也會在您的設備處於後臺/靜默狀態時收集您的上述設備信息，並且完成相應統計後采用去標識化、加密等措施來進行保護。
      </b>
    </p>
    <p class="text-left">
      2.為確保您的賬戶、虛擬財產及使用記錄等不會丟失，您需要提供以下信息完成賬號的綁定：手機號、驗證碼；但如果您不提供這些信息，將不會影響使用本產品的基本功能。<b
        >您提供的上述信息，將在您使用本產品期間持續授權本應用使用。在您註銷賬號時，本應用將停止使用並刪除上述信息。</b
      >
    </p>
    <p class="text-left">
      3.為了更好地向您推薦、展示或推送可能感興趣的信息，本應用可能會收集您操作、使用本應用軟件必要的行為信息用於生成用戶畫像和個性化展示，包括但不限於：發布、點擊、瀏覽、反饋-等，以及您自己填寫、標註的興趣、喜好等。<b
        >上述信息僅在您使用本產品期間會被使用。</b
      >
    </p>
    <p class="text-left">
      4.設備信息：我們會申請電話/設備權限，收集設備識別碼相關信息，<b
        >用於信息推送和安全風控；拒絕該權限，將影響推送的準確度和賬戶安全狀態的提示；。</b
      >
    </p>
    <p class="text-left">
      5.存儲權限：當您使用萬年歷、閱讀等功能時，我們需要申請存儲權限，以通過寫入本地緩存的方式存儲應用的相關數據，<b
        >以保證您的使用記錄等信息不會丟失，並降低流量消耗；</b
      >
    </p>
    <p class="text-left">
      <b
        >6.讀取本地相冊及相機權限。當您設置、更換用戶頭像、添加照片需使用「拍照」功能時，我們會請求您授權相機或本地相冊權限。如果您同時拒絕上述兩個權限，將無法使用此功能。</b
      >
    </p>
    <p class="text-left">
      7.為保障您及時接收相關消息，我們會請求您授權<b>通知權限</b>。如您拒絕提供，僅會使您無法使用該功能，但不影響您正常使用本軟件的其他功能。
    </p>
    <p class="text-left">
      8.讀取日歷權限。當您需要展示系統日歷的日程信息時，我們會請求您日歷權限。如果您拒絕授權提供，將無法使用此功能。
    </p>
    <p class="text-left">
      9.為了正常接收節假日、日程、生日紀念日等重要提醒，您可以在手機系統設置中開啟命理尋真關聯啟動，保證APP相關進程運行來推送提醒信息。<b>
        同時，由於本應用SDK技術由與我們合作的第三方機構提供，為保障消息觸達的及時性，在您使用消息推送服務時，您可以授權我們進行鏈路調節，相互促活被關閉的SDK推送進程，從而保障推送消息的有效觸達。上述內容您可詳閱本政策第四條。
      </b>
    </p>
    <p class="text-left">
      10.您在使用传统文化测算报告服务时，您需要填写您的姓名、生日、出生地、宝宝姓氏、出生状态、宝宝性别、宝宝出生日期等信息，使用服务前，第三方平台将会明确获取您的同意，请您详细第三方相关条款后选择是否同意授权，<b
        >本平台将不记录和收集上述信息。</b
      >
    </p>
    <p class="text-left">
      11.如果您在本應用發生交易行為，則相關支付功能由我們合作的第三方機構向您提供，第三方機構可能需要收集您的姓名、銀行卡類型、銀行卡賬號、銀行卡有效期、銀行卡綁定的手機號碼。如果您拒絕提供支付必須信息，則您無法完成交易，從而無法使用對應的服務，但不會影響其他功能的正常使用。<b
        >我們僅會從第三方機構處獲取您的交易成功的結果驗證信息並向您提供服務。在您註銷賬號時，本應用將停止使用並刪除上述信息。</b
      >
    </p>
    <p>
      <b>
        <span class="ml-32"> 12.自啟動和關聯啟動說明 </span>
        <br />
        <span class="ml-32">
          1）為確保本應用處於關閉或後臺狀態下可以正常收到節假日、日程、紀念日等重要提醒，本應用須使用（自啟動）能力，將存在一定頻率通過系統發送廣播喚醒本應用自啟動或關聯啟動行為，是因實現功能及服務所必要。
        </span>
        <br />
        <span class="ml-32">
          2）當您打開內容類推送消息，在征得您的明確同意後，會跳轉打開相關內容。在未征得您的同意情況下，則不會有自啟動或關聯啟動。
        </span>
        <br />
        <span class="ml-32">
          3）由於本應用SDK技術由與我們合作的第三方機構提供，為保障消息觸達的及時性，在您使用消息推送服務時，您可以授權我們進行鏈路調節，相互促活被關閉的SDK推送進程，從而保障推送消息的有效觸達。上述內容您可詳閱本政策第四條。
        </span>
      </b>
    </p>
    <p class="text-left">
      <b>
        13.當您使用交互功能（如搖動、扭動、扭轉設備）時，我們會調用設備的陀螺儀、加速度、重力傳感器以識別判斷您的設備狀態。請您理解，單獨的設備傳感器數據不涉及任何個人位置信息且無法與其他信息結合用於識別特定自然人的身份。
      </b>
    </p>
    <p class="text-left">
      <b>
        14.根據相關法律法規規定，以下情形中收集、共享、轉讓、披露您的個人信息無需征得您的授權同意：
        <br />
        <span class="ml-32"> 1）與國家安全、國防安全有關的； </span><br />
        <span class="ml-32">
          2）與公共安全、公共衛生、重大公共利益有關的； </span
        ><br />
        <span class="ml-32">
          3）與犯罪偵查、起訴、審判和判決執行等有關的； </span
        ><br />
        <span class="ml-32">
          4）出於維護個人信息主體或其他個人的生命、財產等重大合法權益但又很難得到您本人授權同意的； </span
        ><br />
        <span class="ml-32">
          5）所收集的個人信息是您自行向社會公眾公開的； </span
        ><br />
        <span class="ml-32">
          6）從合法公開披露的信息中收集您的個人信息的，如合法的新聞報道、政府信息公開等渠道； </span
        ><br />
        <span class="ml-32"> 7）法律法規規定的其他情形。 </span>
      </b>
    </p>
    <p>
      <b
        >二、通過內部數據分析和研究以及第三方SDK統計服務，改善本應用的產品或服務</b
      >
    </p>
    <p class="text-left">
      本應用收集數據是根據您與本應用的互動和您所做出的選擇，包括您的隱私設置以及使用的產品和功能。手機的數據包括SDK/API/JS代碼版本、瀏覽器、互聯網服務提供商、IP地址、平臺、時間戳、應用標識符、應用程序版本、應用分發渠道、軟件安裝列表、設備標識符（IMEI、IMSI、ICCID、Android_ID、MEID）、Mac地址、IOS廣告標識符(IDFA)、重力傳感器。當本應用要將信息用於本隱私權政策所述目的之外時，會事先征求您的同意。
    </p>
    <p>
      <b>三、本應用如何使用cookie和同類技術</b>
    </p>
    <p class="text-left">
      Cookie和同類技術是互聯網中的通用常用技術。當您使用本應用及相關服務時，我們可能會使用相關技術向您的設備發送一個或多個Cookie或匿名標識符，以收集和存儲您訪問、使用本產品時的信息。我們使用Cookie和同類技術主要為了實現以下功能或服務：
    </p>
    <p class="text-left">
      <b>1.保障產品與服務的安全、高效運轉</b>
    </p>
    <p class="text-left">
      我們可能會設置認證與保障安全性的cookie或匿名標識符，使我們確認你是否安全登錄服務，或者是否遇到盜用、欺詐等不法行為。這些技術還會幫助我們改進服務效率，提升登錄和響應速度。
    </p>
    <p class="text-left">
      <b>2.幫助你獲得更輕松的訪問體驗</b>
    </p>
    <p class="text-left">
      使用此類技術可以幫助你省去重復你填寫個人信息、輸入搜索內容的步驟和流程。
    </p>
    <p class="text-left">
      <b> 3.為你推薦、展示、推送你可能感興趣的內容或賬號</b>
    </p>
    <p class="text-left">
      我們可能會利用Cookie和同類技術（例如Beacon、Proxy等技術）了解你的偏好和使用習慣，進行咨詢或數據分析，以改善產品服務及用戶體驗，並優化你對內容的選擇。
    </p>
    <p>
      您可以通過瀏覽器設置或拒絕管理Cookie。但請註意，如果停用的話，您有可能無法享受最佳的服務體驗，某些服務也可能無法正常使用。同時，您還會收到同樣數量的廣告，但這些廣告與您的相關性會降低。
    </p>
    <p class="text-left">
      我們承諾，我們不會將Cookie用於本隱私權政策所述目的之外的任何其他用途。
    </p>
    <p>
      <b>四、本應用如何使用sdk技術</b>
    </p>
    <p class="text-left">
      <b
        >SDK技術由與我們合作的第三方機構提供，我們通過使用SDK來幫助應用獲得統計分析、信息推送等功能，我們通過其披露的技術文檔知悉其要求獲得授權的權限和所收集的數據，在收集過程中，數據會直接傳輸至第三方機構。</b
      >
    </p>
    <p>
      <b> 五、本應用如何共享、轉讓、公開披露您的個人信息 </b>
    </p>
    <p class="text-left">
      <b>
        1.共享：本應用不會向其他任何公司、組織和個人分享您的個人信息，但以下情況除外：
      </b>
      <br />
      <span class="ml-32">
        (1)在獲取明確同意的情況下共享：獲得您的明確同意後，本應用會與其他方共享您的個人信息。
      </span>
      <br />
      <span class="ml-32">
        (2)本應用可能會根據法律法規規定，或按政府主管部門的強製性要求，對外共享您的個人信息。
      </span>
      <br />
      <span class="ml-32">
        (3)與本應用的關聯公司（即同一集團下的其他公司）共享：您的個人信息可能會與本應用關聯公司共享。本應用只會共享必要的個人信息，且受本隱私權政策中所聲明目的的約束。關聯公司如要改變個人信息的處理目的，將再次征求您的授權同意。
      </span>
      <br />
      <span class="ml-32">
        (4)與授權合作夥伴共享：僅為實現本隱私權政策中聲明的目的，本應用的某些服務將由授權合作夥伴提供。本應用可能會與合作夥伴共享您的昵稱、頭像、ID信息及相關設備信息（設備型號、軟件系統版本、軟件安裝列表、Mac地址、唯一設備標識符（IMEI、IMSI、ICCID、Android_ID、IDFA）、IP、設備序列號）等，以提供更好的客戶服務和用戶個性化體驗。例如，本應用合作的提供第三方數據統計和分析服務的公司可能需要采集和訪問個人數據以進行數據統計和分析等服務。在這種情況下，這些公司必須遵守本應用的隱私權政策，采取同等的安全措施。本應用僅會共享提供服務所必須的個人信息，並要求其在完成處理目的後刪除或匿名化處理數據。對本應用與之共享個人信息的公司、組織和個人，本應用會與其簽署嚴格的保密協定，要求他們按照本應用的說明、本隱私權政策以及其他任何相關的保密和安全措施來處理個人信息。
      </span>
    </p>
    <p class="text-left">
      <b>
        2.轉讓：本應用不會將您的個人信息轉讓給任何公司、組織和個人，但以下情況除外： </b
      ><br />
      <span class="ml-32">
        (1)在獲取明確同意的情況下轉讓：獲得您的明確同意後，本應用會向其他方轉讓您的個人信息； </span
      ><br />
      <span class="ml-32">
        (2)在涉及合並、收購或破產清算時，如涉及到個人信息轉讓，本應用會在要求新的持有您個人信息的公司、組織繼續受此隱私權政策的約束，否則本應用將要求該公司、組織重新向您征求授權同意。
      </span>
    </p>
    <p class="text-left">
      <b>3.公開披露：本應用僅會在以下情況下，公開披露您的個人信息：</b><br />
      <span class="ml-32"> (1)獲得您的明確同意後； </span><br />
      <span class="ml-32">
        (2)基於法律的披露：在法律、法律程序、訴訟或政府主管部門強製性要求的情況下，本應用可能會公開披露您的個人信息。 </span
      ><br />
      <span class="ml-32">
        (3)您知悉，即使已經取得您的授權同意，我們也僅會出於合法、正當、必要、特定、明確的目的公開披露您的個人信息，並盡量對公開披露內容中的個人信息進行去標識化處理。
      </span>
    </p>
    <p>
      <b>六、本應用如何保護您的個人信息</b>
    </p>
    <p class="text-left">
      1.本應用已使用符合業界標準的安全防護措施保護您提供的個人信息，防止數據遭到未經授權訪問、公開披露、使用、修改、損壞或丟失。本應用會采取一切合理可行的措施，保護您的個人信息。例如，在您的設備與服務之間交換數據時受SSL加密保護；相關網站提供https安全瀏覽方式；本應用會使用加密技術確保數據的保密性，采取受信賴的保護機製防止數據遭到惡意攻擊；本應用會部署訪問控製機製，確保只有授權人員才可訪問個人信息；以及本應用會舉辦安全和隱私保護培訓課程，加強員工對於保護個人信息重要性的認識。
    </p>
    <p class="text-left">
      2.本應用會采取一切合理可行的措施，確保不收集與提供服務無關的個人信息。本應用只會在達成本政策所述目的所需的期限內保留您的個人信息，除非另有約定需要延長保留期或履行法律義務的前提下限期保留。
    </p>
    <p class="text-left">
      3.互聯網並非絕對安全的環境，本應用將盡力確保或擔保您發送給本應用的任何信息的安全性。如果本應用的物理、技術、或管理防護設施遭到破壞，導致信息被非授權訪問、公開披露、篡改、或毀壞，導致您的合法權益受損，本應用將承擔相應的法律責任。
    </p>
    <p class="text-left">
      4.在不幸發生個人信息安全事件後，本應用將按照法律法規的要求，及時向您告知：安全事件的基本情況和可能的影響、本應用已采取或將要采取的處置措施、您可自主防範和降低風險的建議、對您的補救措施等。本應用將及時將事件相關情況以郵件、信函、電話、推送通知等方式告知您，難以逐一告知個人信息主體時，本應用將會采取合理、有效的方式發布公告。同時，本應用還將按照監管部門要求，主動上報個人信息安全事件的處置情況。
    </p>
    <p>
      <b> 七、您的權利 </b>
    </p>
    <p class="text-left">
      按照馬來西亞相關的法律、法規、標準，以及其他國家、地區的通行做法，本應用保障您對自己的個人信息行使以下權利：
    </p>
    <p class="text-left">
      <b
        >1.您有權訪問您的個人信息，法律法規規定的例外情況除外。如果您想行使數據訪問權，可以通過以下方式自行訪問：</b
      >
    </p>
    <p class="text-left">
      賬戶信息：如果您希望訪問或編輯您的賬戶中的個人資料信息，您可以通過訪問「我的」-「用戶頭像」執行此類操作；
    </p>
    <p class="text-left">
      <b
        >2.更正您的個人信息，當您發現本應用處理的關於您的個人信息有錯誤時，您有權要求本應用做出更正。您還可以在登錄後，點擊「我的」-「用戶頭像」進入個人中心，在該頁面您可修改您的頭像、昵稱、，點擊「四柱八字」在「您的檔案信息」條目中修改您的真實姓名、性別、生日、出生地。</b
      >
    </p>
    <p class="text-left">
      <b
        >3.刪除您的個人信息：在以下情形中，您可以向本應用提出刪除個人信息的請求：</b
      >
    </p>
    <p>
      <span class="ml-32"> (1)如果本應用處理個人信息的行為違反法律法規； </span
      ><br />
      <span class="ml-32">
        (2)如果本應用收集、使用您的個人信息，卻未征得您的同意； </span
      ><br />
      <span class="ml-32">
        (3)如果您撤回了對某個業務功能處理個人信息的同意，並主動提出要求刪除相關個人信息； </span
      ><br />
      <span class="ml-32">
        (4)如果您不再使用本應用的產品或服務，或您註銷了賬號； </span
      ><br />
      <span class="ml-32"> (5)如果本應用不再為您提供產品或服務。 </span><br />
    </p>
    <p class="text-left">
      若本應用決定響應您的刪除請求，本應用還將同時通知從本應用獲得您的個人信息的實體，要求其及時刪除，除非法律法規另有規定，或這些實體獲得您的獨立授權。當您從本應用的產品或服務中刪除信息後，本應用可能不會立即備份系統中刪除相應的信息，但會在備份更新時刪除這些信息。
    </p>
    <p class="text-left">
      <b>
        4.撤回您授權同意：除每個業務功能所必需的個人信息以外。對於非必要的個人信息的收集和使用，您可以隨時給予或收回您的授權同意。如果您使用安卓系統，您可在「我的」-「設置」-「系統設置」-「隱私設置」中收回您的電話信息、文件存儲信息、相機功能、通知功能的相應授權；如果您使用的是iOS系統，您需要通過您手機設置功能進行相應授權收回。
      </b>
    </p>
    <p class="text-left">
      <b
        >5.個人信息主體獲取個人信息副本：您有權獲取您的個人信息副本，在技術可行的前提下，例如數據接口匹配，本應用還可按照您的要求，直接將您的個人信息副本傳輸給您指定的第三方。</b
      >
    </p>
    <p class="text-left">
      <b
        >6.約束信息系統自動決策：在某些業務功能中，本應用可能僅依據信息系統、算法等在內的非人工自動決策機製做出決定。如果這些決定顯著影響您的合法權益，您有權要求本應用做出解釋，本應用將提供適當的救濟方式。</b
      >
    </p>
    <p class="text-left">
      <b
        >7.響應您的上述請求：為保障安全，您可能需要提供書面請求，或以其他方式證明您的身份。本應用可能會要求您驗證自己的身份，然後再處理您的請求。</b
      >
    </p>
    <p class="text-left">
      本應用將在十五天內做出答復。對於您合理的請求，本應用原則上不收取費用，但對多次重復、超出合理限度的請求，本應用將視情收取一定的成本費用。對於那些無端重復、不切實際的請求，本應用將可能無法響應，比如需要單獨開發新系統、徹底改變現行業務模式、給他人合法權益帶來風險、對備份磁盤上的信息進行銷毀等。
    </p>
    <p>
      <b>在以下情形中，按照法律法規要求，本應用將無法響應您的請求：</b><br />
      <span class="ml-32"> (1)與國家安全、國防安全有關的； </span><br />
      <span class="ml-32"> (2)與公共安全、公共衛生、重大公共利益有關的； </span
      ><br />
      <span class="ml-32"> (3)與犯罪偵查、起訴、審判有關的； </span><br />
      <span class="ml-32"> (4)有充分證據證明您存在主觀惡意或濫用權利的； </span
      ><br />
      <span class="ml-32">
        (5)響應您的請求將導致您或其他個人、組織的合法權益受到嚴重損害的。 </span
      ><br />
    </p>
    <p>
      <b>八、兒童個人信息保護</b>
    </p>
    <p class="text-left">
      <b
        >1.本應用的產品和服務主要面向成人。我們重視兒童的信息保護，如您為未滿16歲的未成年人，建議您請您的父母或監護人仔細閱讀本隱私權政策，並在征得您的父母或監護人同意的前提下使用我們的服務或向我們提供信息。</b
      >
    </p>
    <p class="text-left">
      <b
        >2.本應用將不滿16周歲的未成年人均視為兒童。如果沒有父母或監護人的同意，兒童不得對本應用賬號綁定手機號，在使用提現功能綁定身份證時，本應用將會對年齡作以校驗，對於未滿16周歲的用戶，無法進行綁定。我們只會在法律法規允許，父母或監護人明確統一或者保護未成年人所必要的情況下使用，共享，轉讓或披露此信息。我們將根據國家相關法律法規及本政策的規定保護未成年人的個人信息。如果本應用發現自己的未事先獲得可證實的父母同意的情況下收集了兒童的個人信息，則會設法盡快刪除相關數據。</b
      >
    </p>
    <p class="text-left">
      <b
        >3.若您是未成年人的監護人，當您對您所監護的未呈現人的個人信息有相關疑問時或者想對此已收集的信息作出處理時，請通過本隱私權政策公示的聯系方式與我們聯系（本應用設有負責兒童個人信息保護的專員）。</b
      >
    </p>
    <p>
      <b>九、本隱私權政策如何更新</b>
    </p>
    <p class="text-left">
      <b
        >本應用可能適時會對本隱私權政策進行調整或變更，本隱私權政策的任何更新將以標註更新時間的方式公布在本應用的網站上，除法律法規或監管規定另有強製性規定外，經調整或變更的內容一經通知或公布後滿7日即生效。如果隱私權政策涉及個人信息處理類型、目的方式等等變更，我們會再次征得您的同意。</b
      >
    </p>
    <p>
      <b>十、如何聯系本應用</b>
    </p>
    <p class="text-left">
      <b
        >如果您對本隱私政策有任何疑問、意見或建議，通過以下方式與本應用聯系：</b
      >
    </p>
    <p class="text-left">
      <b>公司：COPILOT7 PTE. LTD.</b>
    </p>
    <p class="text-left text-flex">
      <b>公司註冊地址：15 SCOTTS ROAD #03-12 15 SCOTTS （228218）</b>
    </p>
    <p class="text-left">
      <b>個人信息保護/信息安全部門聯系方式：developer@weli.cn </b>
    </p>
    <p>
      <b> 十一、隱私政策有效期及更新時間 </b>
    </p>
    <p class="text-left">
      <b
        >本隱私權政策於2023年11月1日更新，更新滿7日後生效。本隱私權政策長期有效。</b
      >
    </p>
  </div>
</template>

<style>
.title {
  margin-top: 0.6rem;
  font-size: 0.4rem;
  font-weight: bold;
  color: #393939;
}

p {
  /* margin-top: 0.4rem; */
  line-height: 1.5;
  font-size: 0.32rem;
  color: #666;
}
a {
  text-decoration: none;
  color: #008bff;
}

b {
  color: #2a2a2a;
  font-weight: bold;
}
.text-center {
  text-align: center;
}
.text-left {
  text-indent: 0.64rem;
}
.text-flex {
  display: flex;
}
.ml-32 {
  margin-left: 0.32rem;
}
</style>
