<template>
  <div>
    <div class="title text-center">
      <b> 隐私权政策 </b>
    </div>
    <p class="text-left">
      欢迎您使用“命理寻真”（以下简称“本应用”）软件及相关服务。如您未明示同意本隐私权政策，我们无法为您提供完整的产品和服务。如果您同意了本隐私权政策后使用应用，我们将视为您接受和认可我们按照本政策对您的相关信息进行处理，并基于提供的具体产品和服务收集使用相应的个人信息。
    </p>
    <p class="text-left">
      本应用深知个人信息对您的重要性，并会尽遵守合法、正当、必要、诚信的原则处理您的个人信息。本应用将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
    </p>
    <p class="text-left">
      <b>
        请您在使用本应用及相关服务前仔细阅读并理解本政策，在确认充分理解并同意后使用本应用及相关服务。本政策有关您个人信息权益的条款我们已采取加粗形式提示，请您特别关注并重点阅读。
      </b>
    </p>
    <p>一、本应用如何收集和使用您的个人信息</p>
    <p class="text-left">
      个人信息是以电子或者其他方式记录的与已识别或者可识别的自然人有关的各种信息，不包括匿名化处理后的信息。
    </p>
    <p>本应用仅会处于本政策所述的以下目的，收集和使用您的个人信息：</p>
    <p class="text-left">
      <b>
        1.当您使用本应用运行期间，我们会通过收集您的设备型号、软件系统版本、软件安装列表、Mac地址、BSSID、唯一设备标识符（IMEI、IMSI、ICCID、Android_ID、IDFA）、IP、设备序列号、SIM序列号、蓝牙地址来标识唯一用户，从而进行统计分析以便我们为您提供信息展示的最优方案。此外，基于数据统计需要，我们也会在您的设备处于后台/静默状态时收集您的上述设备信息，并且完成相应统计后采用去标识化、加密等措施来进行保护。
      </b>
    </p>
    <p class="text-left">
      2.为确保您的账户、虚拟财产及使用记录等不会丢失，您需要提供以下信息完成账号的绑定：手机号、验证码；但如果您不提供这些信息，将不会影响使用本产品的基本功能。<b
        >您提供的上述信息，将在您使用本产品期间持续授权本应用使用。在您注销账号时，本应用将停止使用并删除上述信息。</b
      >
    </p>
    <p class="text-left">
      3.为了更好地向您推荐、展示或推送可能感兴趣的信息，本应用可能会收集您操作、使用本应用软件必要的行为信息用于生成用户画像和个性化展示，包括但不限于：
      发布、点击、浏览、反馈-等，以及您自己填写、标注的兴趣、喜好等。<b
        >上述信息仅在您使用本产品期间会被使用。</b
      >
    </p>
    <p class="text-left">
      4.设备信息：我们会申请电话/设备权限，收集设备识别码相关信息，<b
        >用于信息推送和安全风控；拒绝该权限，将影响推送的准确度和账户安全状态的提示。</b
      >
    </p>
    <p class="text-left">
      5.存储权限：当您使用万年历、阅读等功能时，我们需要申请存储权限，以通过写入本地缓存的方式存储应用的相关数据，<b
        >以保证您的使用记录等信息不会丢失，并降低流量消耗；</b
      >
    </p>
    <p class="text-left">
      <b
        >6.读取本地相册及相机权限。当您设置、更换用户头像、添加照片需使用“拍照”功能时，我们会请求您授权相机或本地相册权限。如果您同时拒绝上述两个权限，将无法使用此功能。</b
      >
    </p>
    <p class="text-left">
      7.为保障您及时接收相关消息，我们会请求您授权<b>通知权限</b>。如您拒绝提供，仅会使您无法使用该功能，但不影响您正常使用本软件的其他功能。
    </p>
    <p class="text-left">
      8.读取日历权限。当您需要展示系统日历的日程信息时，我们会请求您日历权限。如果您拒绝授权提供，将无法使用此功能。
    </p>
    <p class="text-left">
      9.为了正常接收节假日、日程、生日纪念日等重要提醒，您可以在手机系统设置中开启命理寻真关联启动，保证APP相关进程运行来推送提醒信息。<b>
        同时，由于本应用SDK技术由与我们合作的第三方机构提供，为保障消息触达的及时性，在您使用消息推送服务时，您可以授权我们进行链路调节，相互促活被关闭的SDK推送进程，从而保障推送消息的有效触达。上述内容您可详阅本政策第四条。
      </b>
    </p>
    <p class="text-left">
      10.您在使用传统文化测算报告服务时，您需要填写您的姓名、生日、出生地、宝宝姓氏、出生状态、宝宝性别、宝宝出生日期等信息，使用服务前，第三方平台将会明确获取您的同意，请您详细第三方相关条款后选择是否同意授权，<b
        >本平台将不记录和收集上述信息。</b
      >
    </p>
    <p class="text-left">
      11.如果您在本应用发生交易行为，则相关支付功能由我们合作的第三方机构向您提供，第三方机构可能需要收集您的姓名、银行卡类型、银行卡账号、银行卡有效期、银行卡绑定的手机号码。如果您拒绝提供支付必须信息，则您无法完成交易，从而无法使用对应的服务，但不会影响其他功能的正常使用。<b
        >我们仅会从第三方机构处获取您的交易成功的结果验证信息并向您提供服务。在您注销账号时，本应用将停止使用并删除上述信息。</b
      >
    </p>
    <p>
      <b>
        <span class="ml-32"> 12.自启动和关联启动说明 </span>
        <br />
        <span class="ml-32">
          1）为确保本应用处于关闭或后台状态下可以正常收到节假日、日程、纪念日等重要提醒，本应用须使用（自启动）能力，将存在一定频率通过系统发送广播唤醒本应用自启动或关联启动行为，是因实现功能及服务所必要。
        </span>
        <br />
        <span class="ml-32">
          2）当您打开内容类推送消息，在征得您的明确同意后，会跳转打开相关内容。在未征得您的同意情况下，则不会有自启动或关联启动。
        </span>
        <br />
        <span class="ml-32">
          3）由于本应用SDK技术由与我们合作的第三方机构提供，为保障消息触达的及时性，在您使用消息推送服务时，您可以授权我们进行链路调节，相互促活被关闭的SDK推送进程，从而保障推送消息的有效触达。上述内容您可详阅本政策第四条。
        </span>
      </b>
    </p>
    <p class="text-left">
      <b>
        13.当您使用交互功能（如摇动、扭动、扭转设备）时，我们会调用设备的陀螺仪、加速度、重力传感器以识别判断您的设备状态。请您理解，单独的设备传感器数据不涉及任何个人位置信息且无法与其他信息结合用于识别特定自然人的身份。
      </b>
    </p>
    <p class="text-left">
      <b>
        14.根据相关法律法规规定，以下情形中收集、共享、转让、披露您的个人信息无需征得您的授权同意：
        <br />
        <span class="ml-32"> 1）与国家安全、国防安全有关的； </span><br />
        <span class="ml-32">
          2）与公共安全、公共卫生、重大公共利益有关的； </span
        ><br />
        <span class="ml-32">
          3）与犯罪侦查、起诉、审判和判决执行等有关的； </span
        ><br />
        <span class="ml-32">
          4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人授权同意的； </span
        ><br />
        <span class="ml-32">
          5）所收集的个人信息是您自行向社会公众公开的； </span
        ><br />

        <span class="ml-32">
          6）从合法公开披露的信息中收集您的个人信息的，如合法的新闻报道、政府信息公开等渠道； </span
        ><br />
        <span class="ml-32"> 7）法律法规规定的其他情形。 </span>
      </b>
    </p>
    <p>
      <b
        >二、通过内部数据分析和研究以及第三方SDK统计服务，改善本应用的产品或服务</b
      >
    </p>
    <p class="text-left">
      本应用收集数据是根据您与本应用的互动和您所做出的选择，包括您的隐私设置以及使用的产品和功能。手机的数据包括SDK/API/JS代码版本、浏览器、互联网服务提供商、IP地址、平台、时间戳、应用标识符、应用程序版本、应用分发渠道、软件安装列表、设备标识符（IMEI、IMSI、ICCID、Android_ID、MEID）、Mac
      地址、IOS广告标识符(IDFA)、重力传感器。当本应用要将信息用于本隐私权政策所述目的之外时，会事先征求您的同意。
    </p>
    <p>
      <b>三、本应用如何使用cookie和同类技术</b>
    </p>
    <p class="text-left">
      Cookie和同类技术是互联网中的通用常用技术。当您使用本应用及相关服务时，我们可能会使用相关技术向您的设备发送一个或多个Cookie或匿名标识符，以收集和存储您访问、使用本产品时的信息。我们使用Cookie和同类技术主要为了实现以下功能或服务：
    </p>
    <p class="text-left">
      <b>1.保障产品与服务的安全、高效运转</b>
    </p>
    <p class="text-left">
      我们可能会设置认证与保障安全性的cookie或匿名标识符，使我们确认你是否安全登录服务，或者是否遇到盗用、欺诈等不法行为。这些技术还会帮助我们改进服务效率，提升登录和响应速度。
    </p>
    <p class="text-left">
      <b>2.帮助你获得更轻松的访问体验</b>
    </p>
    <p class="text-left">
      使用此类技术可以帮助你省去重复你填写个人信息、输入搜索内容的步骤和流程。
    </p>
    <p class="text-left">
      <b> 3.为你推荐、展示、推送你可能感兴趣的内容或账号 </b>
    </p>
    <p class="text-left">
      我们可能会利用Cookie和同类技术（例如Beacon、Proxy等技术）了解你的偏好和使用习惯，进行咨询或数据分析，以改善产品服务及用户体验，并优化你对内容的选择。
    </p>
    <p>
      您可以通过浏览器设置或拒绝管理Cookie。但请注意，如果停用的话，您有可能无法享受最佳的服务体验，某些服务也可能无法正常使用。同时，您还会收到同样数量的广告，但这些广告与您的相关性会降低。
    </p>
    <p class="text-left">
      我们承诺，我们不会将Cookie用于本隐私权政策所述目的之外的任何其他用途。
    </p>
    <p>
      <b>四、本应用如何使用sdk技术</b>
    </p>
    <p class="text-left">
      <b
        >SDK技术由与我们合作的第三方机构提供，我们通过使用SDK来帮助应用获得统计分析、信息推送等功能，我们通过其披露的技术文档知悉其要求获得授权的权限
        和所收集的数据，在收集过程中，数据会直接传输至第三方机构。</b
      >
    </p>
    <p>
      <b> 五、本应用如何共享、转让、公开披露您的个人信息 </b>
    </p>
    <p class="text-left">
      <b>
        1.共享：本应用不会向其他任何公司、组织和个人分享您的个人信息，但以下情况除外：
      </b>
      <br />
      <span class="ml-32">
        (1)在获取明确同意的情况下共享：获得您的明确同意后，本应用会与其他方共享您的个人信息。
      </span>
      <br />
      <span class="ml-32">
        (2)本应用可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。
      </span>
      <br />
      <span class="ml-32">
        (3)与本应用的关联公司（即同一集团下的其他公司）共享：您的个人信息可能会与本应用关联公司共享。本应用只会共享必要的个人信息，且受本隐私权政策中所声明目的的约束。关联公司如要改变个人信息的处理目的，将再次征求您的授权同意。
      </span>
      <br />
      <span class="ml-32">
        (4)与授权合作伙伴共享：仅为实现本隐私权政策中声明的目的，本应用的某些服务将由授权合作伙伴提供。本应用可能会与合作伙伴共享您的昵称、头像、ID信息及相关设备信息（设备型号、软件系统版本、软件安装列表、Mac地址、唯一设备标识符（IMEI、IMSI、ICCID、Android_ID、IDFA）、IP、设备序列号）等，以提供更好的客户服务和用户个性化体验。例如，本应用合作的提供第三方数据统计和分析服务的公司可能需要采集和访问个人数据以进行数据统计和分析等服务。在这种情况下，这些公司必须遵守本应用的隐私权政策，采取同等的安全措施。本应用仅会共享提供服务所必须的个人信息，并要求其在完成处理目的后删除或匿名化处理数据。对本应用与之共享个人信息的公司、组织和个人，本应用会与其签署严格的保密协定，要求他们按照本应用的说明、本隐私权政策以及其他任何相关的保密和安全措施来处理个人信息。
      </span>
    </p>
    <p class="text-left">
      <b>
        2.转让：本应用不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外： </b
      ><br />
      <span class="ml-32">
        (1)在获取明确同意的情况下转让：获得您的明确同意后，本应用会向其他方转让您的个人信息； </span
      ><br />
      <span class="ml-32">
        (2)在涉及合并、收购或破产清算时，如涉及到个人信息转让，本应用会在要求新的持有您个人信息的公司、组织继续受此隐私权政策的约束，否则本应用将要求该公司、组织重新向您征求授权同意。
      </span>
    </p>
    <p class="text-left">
      <b>3.公开披露：本应用仅会在以下情况下，公开披露您的个人信息：</b><br />
      <span class="ml-32"> (1)获得您的明确同意后； </span><br />
      <span class="ml-32">
        (2)基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，本应用可能会公开披露您的个人信息； </span
      ><br />
      <span class="ml-32">
        (3)您知悉，即使已经取得您的授权同意，我们也仅会出于合法、正当、必要、特定、明确的目的公开披露您的个人信息，并尽量对公开披露内容中的个人信息进行去标识化处理。
      </span>
    </p>
    <p>
      <b>六、本应用如何保护您的个人信息</b>
    </p>
    <p class="text-left">
      1.本应用已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。本应用会采取一切合理可行的措施，保护您的个人信息。例如，在您的设备与服务之间交换数据时受SSL加密保护；相关网站提供https安全浏览方式；本应用会使用加密技术确保数据的保密性，采取受信赖的保护机制防止数据遭到恶意攻击；本应用会部署访问控制机制，确保只有授权人员才可访问个人信息；以及本应用会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
    </p>
    <p class="text-left">
      2.本应用会采取一切合理可行的措施，确保不收集与提供服务无关的个人信息。本应用只会在达成本政策所述目的所需的期限内保留您的个人信息，除非另有约定需要延长保留期或履行法律义务的前提下限期保留。
    </p>
    <p class="text-left">
      3.互联网并非绝对安全的环境，本应用将尽力确保或担保您发送给本应用的任何信息的安全性。如果本应用的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，本应用将承担相应的法律责任。
    </p>
    <p class="text-left">
      4.在不幸发生个人信息安全事件后，本应用将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、本应用已采取或将要采取的处置措施、您可
      自主防范和降低风险的建议、对您的补救措施等。本应用将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，本应用将会采取合理、有效的方式发布公告。同时，本应用还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
    </p>
    <p>
      <b> 七、您的权利 </b>
    </p>
    <p class="text-left">
      按照马来西亚相关的法律、法规、标准，以及其他国家、地区的通行做法，本应用保障您对自己的个人信息行使以下权利：
    </p>
    <p class="text-left">
      <b
        >1.您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：</b
      >
    </p>
    <p class="text-left">
      账户信息：如果您希望访问或编辑您的账户中的个人资料信息，您可以通过访问“我的”-“用户头像”执行此类操作；
    </p>
    <p class="text-left">
      <b
        >2.更正您的个人信息，当您发现本应用处理的关于您的个人信息有错误时，您有权要求本应用做出更正。您还可以在登录后，点击“我的”-“用户头像”进入个人中心，在该页面您可修改您的头像、昵称、，点击“四柱八字”在“您的档案信息”条目中修改您的真实姓名、性别、生日、出生地。</b
      >
    </p>
    <p class="text-left">
      <b
        >3.删除您的个人信息：在以下情形中，您可以向本应用提出删除个人信息的请求：</b
      >
    </p>
    <p>
      <span class="ml-32"> (1)如果本应用处理个人信息的行为违反法律法规； </span
      ><br />
      <span class="ml-32">
        (2)如果本应用收集、使用您的个人信息，却未征得您的同意； </span
      ><br />
      <span class="ml-32">
        (3)如果您撤回了对某个业务功能处理个人信息的同意，并主动提出要求删除相关个人信息； </span
      ><br />
      <span class="ml-32">
        (4)如果您不再使用本应用的产品或服务，或您注销了账号； </span
      ><br />
      <span class="ml-32"> (5)如果本应用不再为您提供产品或服务。 </span><br />
    </p>
    <p class="text-left">
      若本应用决定响应您的删除请求，本应用还将同时通知从本应用获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。当您从本应用的产品或服务中删除信息后，本应用可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
    </p>
    <p class="text-left">
      <b>
        4.撤回您授权同意：除每个业务功能所必需的个人信息以外。对于非必要的个人信息的收集和使用，您可以随时给予或收回您的授权同意。如果您使用安卓系统，您可在“我的”-“设置”-“系统设置”-“隐私设置”中收回您的电话信息、文件存储信息、相机功能、通知功能的相应授权；如果您使用的是iOS系统，您需要通过您手机设置功能进行相应授权收回。
      </b>
    </p>
    <p class="text-left">
      <b
        >5.个人信息主体获取个人信息副本：您有权获取您的个人信息副本，在技术可行的前提下，例如数据接口匹配，本应用还可按照您的要求，直接将您的个人信息副本传输给您指定的第三方。</b
      >
    </p>
    <p class="text-left">
      <b
        >6.约束信息系统自动决策：在某些业务功能中，本应用可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求本应用做出解释，本应用将提供适当的救济方式。</b
      >
    </p>
    <p class="text-left">
      <b
        >7.响应您的上述请求：为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。本应用可能会要求您验证自己的身份，然后再处理您的请求。</b
      >
    </p>
    <p class="text-left">
      本应用将在十五天内做出答复。对于您合理的请求，本应用原则上不收取费用，但对多次重复、超出合理限度的请求，本应用将视情收取一定的成本费用。对于那些无端重复、不切实际的请求，本应用将可能无法响应，比如需要单独开发新系统、彻底改变现行业务模式、给他人合法权益带来风险、对备份磁盘上的信息进行销毁等。
    </p>
    <p>
      <b>在以下情形中，按照法律法规要求，本应用将无法响应您的请求：</b><br />
      <span class="ml-32"> (1)与国家安全、国防安全有关的； </span><br />
      <span class="ml-32"> (2)与公共安全、公共卫生、重大公共利益有关的； </span
      ><br />
      <span class="ml-32"> (3)与犯罪侦查、起诉、审判有关的； </span><br />
      <span class="ml-32"> (4)有充分证据证明您存在主观恶意或滥用权利的； </span
      ><br />
      <span class="ml-32">
        (5)响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。 </span
      ><br />
    </p>
    <p>
      <b>八、儿童个人信息保护</b>
    </p>
    <p class="text-left">
      <b
        >1.本应用的产品和服务主要面向成人。我们重视儿童的信息保护，如您为未满16岁的未成年人，建议您请您的父母或监护人仔细阅读本隐私权政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供信息。</b
      >
    </p>
    <p class="text-left">
      <b
        >2.本应用将不满16周岁的未成年人均视为儿童。如果没有父母或监护人的同意，儿童不得对本应用账号绑定手机号，在使用提现功能绑定身份证时，本应用将会对年龄作以校验，对于未满16周岁的用户，无法进行绑定。我们只会在法律法规允许，父母或监护人明确统一或者保护未成年人所必要的情况下使用，共享，转让或披露此信息。我们将根据国家相关法律法规及本政策的规定保护未成年人的个人信息。如果本应用发现自己的未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。</b
      >
    </p>
    <p class="text-left">
      <b
        >3.若您是未成年人的监护人，当您对您所监护的未呈现人的个人信息有相关疑问时或者想对此已收集的信息作出处理时，请通过本隐私权政策公示的联系方式与我们联系（本应用设有负责儿童个人信息保护的专员）。</b
      >
    </p>
    <p>
      <b>九、本隐私权政策如何更新</b>
    </p>
    <p class="text-left">
      本应用可能适时会对本隐私权政策进行调整或变更，本隐私权政策的任何更新将以标注更新时间的方式公布在本应用的网站上，除法律法规或监管规定另有强制性规定外，经调整或变更的内容一经通知或公布后满7日即生效。<b
        >如果隐私权政策涉及个人信息处理类型、目的方式等等变更，我们会再次征得您的同意。</b
      >
    </p>
    <p>
      <b>十、如何联系本应用</b>
    </p>
    <p class="text-left">
      <b
        >如果您对本隐私政策有任何疑问、意见或建议，通过以下方式与本应用联系：</b
      >
    </p>
    <p class="text-left">
      <b>公司：COPILOT7 PTE. LTD.</b>
    </p>
    <p class="text-left text-flex">
      <b>公司注册地址：15 SCOTTS ROAD #03-12 15 SCOTTS （228218）</b>
    </p>
    <p class="text-left">
      <b>个人信息保护/信息安全部门联系方式：developer@weli.cn </b>
    </p>
    <p>
      <b> 十一、隐私政策有效期及更新时间 </b>
    </p>
    <p class="text-left">
      <b
        >本隐私权政策于2023年11月1日更新，更新满7日后生效。本隐私权政策长期有效。</b
      >
    </p>
  </div>
</template>

<style>
.title {
  margin-top: 0.6rem;
  font-size: 0.4rem;
  font-weight: bold;
  color: #393939;
}

p {
  /* margin-top: 0.4rem; */
  line-height: 1.5;
  font-size: 0.32rem;
  color: #666;
}
a {
  text-decoration: none;
  color: #008bff;
}

b {
  color: #2a2a2a;
  font-weight: bold;
}
.text-center {
  text-align: center;
}
.text-left {
  text-indent: 0.64rem;
}
.text-flex {
  display: flex;
}
.ml-32 {
  margin-left: 0.32rem;
}
</style>
